[
  {
    "subject": "Cultural and Creative Arts",
    "content": "1. Which instrument is played by blowing air through a mouthpiece? a) Drum b) Trumpet c) Violin\\n2. What kind of instrument is a piano? a) String instrument b) Percussion instrument c) Keyboard instrument\\n3. Which of these is a string instrument? a) Flute b) Guitar c) Trumpet\\n4. What do you use to play a violin? a) A bow b) A stick c) Your hands\\n5. Which instrument is played by striking keys with fingers? a) Flute b) Piano c) Trombone\\n6. Which of these instruments is part of the brass family? a) Saxophone b) Trombone c) Violin\\n7. What is the largest instrument in the string family? a) Harp b) Cello c) Double bass\\n8. Which instrument is often used to keep the rhythm in a band? a) Drums b) Flute c) Trumpet\\n9. Which of these instruments is a wind instrument? a) Clarinet b) Guitar c) Trumpet\\n10. Which instrument has black and white keys? a) Violin b) Piano c.Keyboard\\n11. What is the main role of an actor? a) Write scripts b) Perform in plays c) Build sets\\n12. What do you call the place where plays are performed? a) Museum b) Theatre c) School\\n13. What is the name of the person who writes the script for a play? a) Director b) Producer c) Playwright\\n14. In a play, what do you call the person who helps actors perform their roles? a) Musician b) Director c) Designer\\n15. What do you call a dramatic performance where the actors do not speak, only act out the story? a) Musical b) Pantomime c) Comedy\\n16. Which of these is a costume accessory an actor might wear for a play? a) Sunglasses b) Helmet c) Hat\\n17. What do you call the words an actor says in a play? a) Lines b) Music c) Notes\\n18. Which of these is an example of a famous play? a) The Lion King b) Hamlet c) Frozen\\n19. Which of these is an element of drama? a) Plot  b) Weather c) Painting\\n20. What do you call the main story of a play? a) Script b) Plot c) Costume\\n21. What is a character in a story or play?\\na) The place where the story happens b) A person or animal in the story c) The event that happens in the story\\n22. Which of these is a type of character in a play? a) Protagonist b) Stage c) Director\\n23. Who is the main character in a story or play? a) The villain b) The protagonist c) The background character\\n24. What does a villain do in a story or play? a) Helps the hero b) Creates problems for the hero c) Directs the play\\n25. Who is an actor? a) A person who writes a play b) A person who performs on stage or in movies c) A person who designs costumes\\n26. What is play acting? a) Acting out a story or a scene b) Drawing pictures c) Reading books silently\\n27. What does an actor do when performing? a) Tells jokes to the audience b) Pretends to be a character and speaks lines c) Watches other actors\\n28. What is the purpose of body movement in acting? a) To distract the audience b) To help tell the story and show emotions c) To make people laugh\\n29. Which of the following is a type of body movement in acting? a) Jumping, running, and dancing b) Sitting still and looking at the audience c) Drawing on paper\\n30. What is dance? a) Moving to music using different body movements b) A kind of art made with colors c) A type of acting on stage\\n31. What do dancers use to express emotions in dance? a) Their voice b) Their body movements c) Their words\\n32. What is a dramatic character? a) A character who is fun and playful b) A character who acts in a serious or emotional way c) A character who sings in a play\\n33. What is the role of a supporting character? a) To be the main focus of the story b) To help tell the story and support the main character c) To stay quiet and not speak\\n34. What is improvisation in acting? a) Acting without a script, making up lines on the spot b) Following the script exactly as written c) Dancing to music\\n35. What kind of character is a hero? a) A character who is good and solves problems b) A character who is bad and causes trouble c) A character who does not speak\\n36. What is an emotion that an actor might show through body movement? a) Happiness, sadness, or anger b) Excitement for food c) Sleeping\\n37. What do actors wear to help them become their characters? a) Costumes b) Casual clothes c) Jeans and t-shirts\\n38. Why is body language important in acting? a) It helps actors show feelings and actions without words b) It makes actors look taller c) It makes actors move faster\\n39. What is the first step in learning to dance? a) Listening to the music b) Buying special shoes c) Watching a movie\\n40. What kind of dance can be performed with music in a play? a) Ballet b) Hip-hop c) Both ballet and hip-hop\\nFILL IN THE BLANKS\\n1. In a _______ performance, actors pretend to be characters and act out a story.\\n2. _______ is a form of art where people move their bodies to music to tell a story or express emotions.\\n3. In a _______ dance, people often wear costumes and perform to tell a traditional story or celebrate an event.\\n4. A _______ is a person who performs in plays or shows and acts out different roles.\\n5. _______ is when a dancer moves in a way that matches the beat or rhythm of the music."
  },
  {
    "subject": "Physical and Health Education",
    "content": "1. What should you do to stop the spread of germs? a) Wash your hands b) Eat candy c) Stay outside\\n2. What does a healthy community need? a) Healthy people b) A lot of candy c) Trash everywhere\\n3. Which of these is important for staying healthy? a) Drinking lots of soda b) Eating fruits and vegetables c) Sleeping all day\\n4. What is the best way to stop the spread of illness in a community? a) Sharing food with everyone b) Washing hands regularly c) Not drinking water\\n5. What should you do if you feel sick? a) Go to school and play b) Stay home and rest c) Go to a friend"
  },
  {
    "subject": "Basic Science and Technology",
    "content": "1. What are weeds? a) Helpful plants that we grow b) Unwanted plants that grow in gardens c) Plants we eat\\n2. How do weeds affect your garden? a) They help other plants grow b) They take nutrients and water from other plants c) They make flowers bloom\\n3. Which of these is a common weed? a) Rose b) Dandelion c) Tulip\\n4. What can you do to get rid of weeds in your garden? a) Water them more b) Pull them out by hand c) Leave them alone\\n5. Why is it important to remove weeds from your garden? a) To make the garden look better b) To stop them from stealing water and nutrients from other plants c) To make the plants grow taller\\n6. Which of these tools can be used to remove weeds? a) Shovel  b) Scissors c) Rake\\n7. What is the best time to remove weeds? a) In the morning when its cool b) At night c) When it rains\\n8. How can weeds spread in a garden? a) Through their seeds blowing in the wind b) Through their flowers c) By growing flowers\\n9. What happens if you leave weeds in your garden too long? a) They can start to grow flowers b) They can take over the garden and damage other plants c) They make the soil healthier\\n10. What do you call a plant that is hard to get rid of because it grows back quickly? a) Vine b) Perennial weed c) Flower\\n11. What is a shovel used for in a garden? a) Digging holes b) Watering plants c) Picking flowers\\n12. Which tool is used to break up hard soil? a) Hoe b) Trowel c) Rake\\n13. What is a rake used for? a) Digging holes b) Gathering leaves and grass c) Planting seeds\\n14. Which gardening tool is used to plant small seeds? a) Spade b) Trowel c) Fork\\n15. What is the purpose of a watering can? a) To cut the grass b) To water plants c) To dig holes\\n16. Which tool helps you trim or prune small branches? a) Pruning shears b) Rake c) Shovel\\n17. What is a wheelbarrow used for? a) Carrying plants b) Digging holes c) Transporting soil or tools\\n18. What is the best tool to use when planting young plants in the garden? a) Trowel  b) Hoe c) Spade\\n19. Which tool can be used to move heavy piles of soil? a) Shovel b) Fork c) Wheelbarrow\\n20. Which of these tools is used to aerate the soil? a) Rake b) Hoe c) Garden fork\\n21. What is the main purpose of teeth? a) To help us talk b) To help us chew food c) To make our mouth look nice\\n22. Which type of teeth are used for cutting food into small pieces? a) Molars b) Incisors c) Canines\\n23. What do canines help us do? a) Grind food b) Tear food c) Cut food\\n24. What is the job of molars in the mouth? a) To cut food b) To grind and crush food c) To tear food\\n25. How many types of teeth are there in a human mouth? a) One type b) Three types c) Five types\\n26. What do incisors look like? a) Pointed and sharp b) Flat and wide c) Short and flat\\n27. What is the purpose of saliva in our mouth? a) To help us breathe b) To soften and moisten food for easier chewing c) To clean our teeth\\n28. What do we call the process of breaking down food into smaller parts using teeth and saliva? a) Digestion b) Biting c) Chewing\\n29. What is the first step in the human feeding system? a) Swallowing b) Chewing c) Eating food\\n30. Where does digestion begin in the human body? a) In the stomach b) In the mouth c) In the intestines\\n31. What is the role of the esophagus in digestion? a) It stores food b) It helps break down food c) It moves food from the mouth to the stomach\\n32. What is the main purpose of the stomach in digestion? a) To absorb nutrients b) To chew food c) To break down food with acids and enzymes\\n33. What does the small intestine do in the human feeding system? a) It absorbs nutrients from food b) It grinds food c) It holds food\\n34. What is the function of water in our body? a) To provide energy b) To keep the body hydrated and help digestion c) To make us feel full\\n35. Why is it important to drink enough water each day? a) To help us grow taller b) To keep our body hydrated and healthy c) To give us more energy\\n36. What happens if you don"
  },
  {
    "subject": "Computer",
    "content": "1. What is software? a) A physical part of a computer b) A set of instructions that tells the computer what to do c) A type of computer hardware\\n2. Which of these is an example of software? a) Keyboard b) Microsoft Word c) Mouse\\n3. What does an operating system do? a) It stores files b) It helps the computer run programs c) It adds more RAM to the computer\\n4. What is a game on a computer considered? a) Hardware b) Software c) A device\\n5. Which of these is used to write documents on a computer? a) Internet browser b) Word processing software c) Mouse\\n6. Which software helps you browse the internet? a) Word processor b) Web browser c) Music player\\n7. Which of the following is an example of educational software? a) A video game b) A math learning app c) A printer\\n8. What is an app? a) A type of hardware b) A software program you can download to your phone or computer c) A storage device\\n9. Which software is used to make drawings on a computer? a) Paint b) Calculator c) Browser\\n10. What do you need to open a file on a computer? a) A keyboard b) Software that can open the file c) A mouse\\n11. What is hardware? a) The software that runs a computer b) The physical parts of a computer c) A website you visit\\n12. Which of these is an example of computer hardware? a) Internet browser b) Mouse c) Word document\\n13. What does a keyboard do? a) It displays pictures on the screen b) It allows you to type on the computer c) It stores files\\n14. Which of these is an input device? a) Monitor b) Mouse c) Printer\\n15. What is the main function of a computer monitor? a) To store data b) To display information c) To print documents\\n16. What do you use to hear sounds from a computer? a) Keyboard b) Speaker c) Mouse\\n17. Which of these is an example of storage hardware? a) Monitor b) Hard drive c) Keyboard\\n18. What does the mouse do? a) It helps you hear sounds b) It helps you move the pointer on the screen c) It stores information\\n19. What part of the computer is used to print documents? a) Speaker b) Printer c) Keyboard\\n20. Which of these is an example of a portable storage device? a) USB flash drive b) Monitor c) Compuer\\n21. What is the purpose of a computer cable? a) To play music b) To connect the computer to other devices c) To decorate the computer\\n22. Which cable connects a computer to the internet? a) USB cable b) HDMI cable c) Ethernet cable\\n23. What does a power cable do for a computer? a) It helps the computer connect to the internet b) It charges the computer"
  },
  {
    "subject": "History",
    "content": "1. Who was King Jaja of Opobo? a) A famous writer b) A great leader and warrior of Opobo c) A famous singer\\n2. Where was King Jaja of Opobo from? a) Lagos b) Opobo c) Zaria\\n3. What was King Jaja of Opobo known for? a) Trading and making Opobo a rich city b) Writing books c) Becoming a teacher\\n4. What was Oba Ovonranwen known for? a) His role in defending Benin against invaders b) Being a famous athlete c) Writing songs\\n5. Where did Oba Ovonranwen rule? a) Opobo b) Benin c) Zaria\\n6. Why was Oba Ovonranwen important to the Benin Kingdom? a) He helped build bridges b) He fought to protect his kingdom during the British invasion c) He taught people how to farm\\n7. Who was Chief Nana of Itsekiri? a) A famous scientist b) A wealthy and powerful leader of the Itsekiri people c) A popular singer\\n8. Where did Chief Nana of Itsekiri rule? a) Opobo b) Itsekiri c) Zaria\\n9. What was Chief Nana of Itsekiri known for? a) His bravery in the fight against British forces  b) His art skills c) His ability to sing\\n10. Who was Queen Aminat of Zaria? a) A famous leader who ruled the Kingdom of Zaria b) A famous teacher c) A well-known musician\\n11. What is Queen Aminat of Zaria famous for? a) Being a warrior who expanded the Kingdom of Zaria b) Building schools c) Writing books\\n12. Where did Queen Aminat of Zaria rule? a) Opobo b) Zaria c) Benin\\n13. What did Queen Aminat of Zaria do during her reign? a) She fought battles to protect her kingdom b) She built bridges c) She traveled around the world\\n14. Which hero helped in the defense of the Benin Kingdom against the British? a) King Jaja b) Chief Nana c) Oba Ovonranwen\\n15. What was one of the challenges King Jaja of Opobo faced? a) Fighting invaders b) Being exiled by the British c) Building a new city\\n16. What did Chief Nana of Itsekiri do after fighting the British? a) He became a teacher b) He moved to another country c) He went into exile\\n17. Which of these heroes or heroines fought to protect their land from foreign invasion? a) Queen Aminat b) Chief Nana c) All of the above\\n18. How did Queen Aminat of Zaria help her people? a) By leading successful military campaigns b) By creating art c) By planting trees\\n19. What did King Jaja of Opobo help his people with? a) Developing the trade business b) Building schools c) Writing history books\\n20. Which of the following heroes was a leader of the Itsekiri people? a) Chief Nana b) Queen Aminat c) Oba Ovonrowen\\n21. Where do the Nupe people mostly live? a) In the southeastern part of Nigeria b) In the central part of Nigeria c) In the northern part of Nigeria\\n22. What language do the Nupe people speak? a) Hausa b) Nupe c) Yoruba\\n23. The Nupe people are known for which traditional activity? a) Weaving and making pottery b) Farming and fishing c) Writing books\\n24. What is the capital of the Nupe people’s region? a) Lokoja b) Minna c) Kaduna\\n25. Which of these is a common food among the Nupe people? a) Pounded yam and soup b) Fufu and egusi c) Tuwo and vegetable soup\\n26. Where do the Jukun people live? a) In the southern part of Nigeria b) In the northeastern part of Nigeria c) In the central and northeastern parts of Nigeria\\n27. What language do the Jukun people speak? a) Jukun b) Kanuri c) Igbo\\n28. Which of these is a traditional Jukun dance? a) Argungu b) Waza c) Jukun traditional dance\\n29. What is the Jukun people’s main occupation? a) Fishing and farming b) Hunting and gathering c) Trading and weaving\\n30. Which state is home to many Jukun people? a) Kogi State b) Taraba State c) Ogun State\\n31. What is the traditional attire of the Gbagyi people? a) Brightly colored robes b) Simple, local fabric wraps c) Animal skins\\n32. The Gbagyi people are known for living in which region of Nigeria? a) The southwestern region b) The central region c) The southeastern region\\n33. What language do the Gbagyi people speak? a) Gbagyi b) Yoruba c) Ibo\\n34. What is the main food of the Gbagyi people? a) Rice and beans b) Yam and cassava c) Noodles and soup\\n35. What is a traditional Gbagyi festival? a) Durbar Festival b) Ngu Festival c) Argungu Festival\\n36. The Gbagyi people are also known for what? a) Excellent farming skills b) Pottery making c) Weaving traditional clothes\\n37. Which of these is a major source of income for the Nupe people? a) Fishing b) Hunting c) Trading and farming\\n38. What kind of houses do the Jukun people live in? a) Mud huts and houses with thatched roofs b) Tall skyscrapers c) Wooden houses with roofs made of metal\\n39. Which of the following is a well-known festival of the Gbagyi people? a) Sallah b) Ngu Festival c) Owu Festival\\n40. What is a traditional item that the Nupe people are known for making? a) Wooden masks b) Pottery and woven baskets c) Metal swords\\nFILL IN THE BLANKS\\n1. King Jaja of Opobo was originally born with the name ________.\\n2.King Jaja of Opobo was known for his strong leadership in the ________ trade.\\n3. King Jaja founded the town of ________ in the Niger Delta region.\\n4. Queen Amina was a famous warrior queen from the ancient kingdom of ________.\\n5. Queen Amina is famous for building strong ________ to protect her kingdom."
  }
]