[
  {
    "subject": "History",
    "content": "INSTRUCTION: ANSWER ALL QUESTIONS  \\n\\n1.  A person that is regarded as a special person by people because he has done something brave is known as _____________(a) Governor (b) President (c) Hero \\n\\n2.  _______________ is a popular dance among the Tiv people. (a) Ekombi (b) Swange (c) Bata  \\n\\n3.  Okun are the ______________ speaking group in Kogi state. (a) Yoruba (b) Hausa (c) Efik  \\n\\n4.  The Mumuye are also known as _____________(a) Okun (b) Fulani (c) Gengle  \\n\\n5.  The Mumuye can be found in ____________ state. (a) Adamawa (b) Taraba (c) Bauchi  \\n\\n6.  ____________is an example of a town where majorly Okun people can be found. (a) Kaaba (b) Lagos (c) Jalingo \\n\\n7.  The traditional occupation of Fulani men is _____________ (a) Farming (b) Fishing (c) Cattle rearing  \\n\\n8.  _____________ is a cultural festival of the Ibibio. (a) Egungun (b) New yam (c) Ekpe  \\n\\n9.  The language spoken by the Igala is _______________(a) Efik (b) Igala (c) Hausa  \\n\\n10.  The _____________ people can be found in towns like Oturkpo, Owukpa and Ogboju. (a) Idoma (b) Igala (c) Fulani  \\n\\n11.  The Kalabari"
  },
  {
    "subject": "Religion Studies",
    "content": "1.  Which prophesy came to pass with the birth of Jesus Christ years later? (a) The prophecy of the kingdom of God (b) The prophecy of the birth of Jesus (c) The prophecy of agony  \\n\\n2.  Which Prophet foretold the birth of Jesus? (a) Isaiah (b) Jeremiah (c) Daniel  \\n\\n3.  The meaning of Emmanuel illustrates that God is always _________ (a) With us and around us every second, minute and hour (b) God always care for us (c) God always gives us life  \\n\\n4.  God is the one who is always protecting and guiding us. (a) True (b) False  \\n\\n5.  What is the first attribute that the Prophet said His name shall be called? (a) Emmanuel (b) Wonderful (c) Counsellor  \\n\\n6.  For us to serve God, expect Him to guide our path and comfort us, we must ask for His Holy Spirit to live in us. (a) True (b) False  \\n\\n7.  For unto us a child is born, unto us a Son is given, and the government shall be upon His ___________ (a) Hand (b) Head (c) Shoulder  \\n\\n8.  And His name shall be called (a) Wonderful, Counselor, Jehovah, Everlasting God (b) Wonderful, Counselor, The Mighty God, Yahweh (c) Wonderful, Counselor, The Mighty God, The Everlasting Father, The Prince of Peace  \\n\\n9.  On the day of Pentecost, the disciples of Jesus came together in a house in ____________ (a) Bethlehem (b) Rome (c) Jerusalem  \\n\\n10.  As they were praying together, a ___________ came down suddenly from the sky like the rush of a powerful mighty wind, and filled the house. (a) Manner (b) Angel (c) Voice  \\n\\n11.  Who is the Holy Spirit? (a) God, living in us (b) God"
  },
  {
    "subject": "French",
    "content": "1.  What is \\"
  },
  {
    "subject": "Math",
    "content": "1.  What is the value of 9 in the number 983? (a) Thousand (b) Hundred (c) Tens  \\n\\n2.  What is the value of 8 in the number 581? (a) Unit (b) Hundred (c) Tens  \\n\\n3.  What is the value of 1 in the number 981? (a) Units (b) Tens (c) Hundreds  \\n\\nFigure Out.  \\n\\nCiara had a ninth birthday party. There were 12 friends at her party. Half of Ciara"
  }
]