[
  {
    "subject": "History",
    "content": "### Third Term Begins\n\n**History** 20/5/2025\n\n#### Towns in Nigeria\n\nThere are various towns in Nigeria located at various geographical territories. Some of these towns are ancient while some are modern. Both ancient and modern towns have their own history. They have their origins, mode of dressing, language, festival and other ways of life. While the modern towns are settlement of people in recent time.\n\n#### Ancient Towns in Nigeria\n\nAncient towns are towns that have been in existence for a long time. There are some towns that have been in existence in the distant past in Nigeria. Some of them include: Ile-Ife, Aba, Benin, Bonny, Calabar, Daura, Gobir e.t.c.\n\nA) **Benin**: Benin is one of the ancient cities in Nigeria. It is the present capital of Edo state. It was known as the Benin Empire or Kingdom in the past. The Kingdom has a historical relationship with the Yorubas. Exactly when the great Oba of Benin, In 1440 Oba Ewuare came to power, the new Oba rebuilt the city and developed a great artistic culture. The city also became famous especially with its art of Bronze, Iron and Ivory. Benin City is known as Edonokhodu. The traditional ruler of Benin is known as Oba.\n\n---\n\n#### Towns in Nigeria (cont.) 26/5/2025\n\nB) **Ife**: Ile-Ife is an ancient Yoruba city located in Osun state. The Yoruba people refer to Ife as their origin or ancestral home. Ile-Ife is widely known for its ancient and indigenous bronze, artworks, stone and terra-cotta sculptures. Oduduwa is regarded as the father of Yoruba race all over the world. Oranmiyan was an oba in Ile-Ife. He was the son of Oduduwa. The city is rich in culture and tradition. Ile-Ife is the city where the Yoruba believe their civilization began as well as the location where the gods first came when they got to the earth.\n\n---\n\n#### ANCIENT TOWNS IN NIGERIA\n\nc) **KANO**: Kano is an ancient town located in Kano State Nigeria. It was known as Kano kingdom in the distant past. It was founded..."
  },
  {
    "subject": "Religious Studies",
    "content": "### C.R.S 20/5/2025\n\n#### Showing Desire for Peaceful Co-existence\n\nPeaceful Co-existence simply means different people living together in peace. When people live together without any disagreement or fight, then there is peaceful co-existence among them.\n\nJesus taught us to live peaceful with others. He advised us that if somebody offends us, we should forgive the person and live happily together.\n\n#### Instances in the bible of people desiring peaceful co-existence.\n\nGod wants us to live peacefully with others in the community. In the Bible, there are good examples of people who lived happily together to prevent disagreement.\n\nExamples are Esau and Jacob who reconciled after Jacob took the blessings of Esau, his brother from their father.\n\nAlso, there were philemon and onesimus, Isaac and Abimelech and Abraham who prevented a quarrel between him and his nephew, Lot.\n\n---\n\n### C.R.S 20/5/2025\n\n#### Showing Love and Unselfishness\n#### Moral responsibility of showing unselfish love to others.\n\nIt is good to show love to others. We should consider those who are around us. Jesus wants us to show love and hospitality to people.\n\nWe should tell them the truth and be open-minded to them.\n\n#### The Love between Jonathan and David\n\nThere were two people in the bible who showed unselfish love to each other. Jonathan loved David very much. He loved him as his own soul. When king Saul (Jonathan's Father) planned to kill David, it was Jonathan who saved David by telling him the plans of Saul.\n\nHe hid him in a place far away from Saul's sight. They loved each other so much that they even made a covenant.\n\n---\n\n#### The Love that should exist among the pupils\n\nPupils and everybody in the society should show love to one another. We should show love to those in danger and give help to the needy.\n\nOther ways to show love are stated below\n1. We should share our belongings with others.\n2. We should protect one another when there is dang..."
  },
  {
    "subject": "English Language",
    "content": "### English-Language 22/5/2025\n\n#### PARTS OF SPEECH\n\n#### NOUN\n\nNouns are words that name people, places, things and animals. For example:\n*   **Person**: teacher, friend\n*   **Place**: School, Park\n*   **Thing**: book, chair\n*   **Animal**: dog, cat\n\n#### TYPES OF NOUN\n\n1.  **Proper Nouns**: These are names of specific people or organizations. E.g John, London, Google.\n2.  **Common Nouns**: These are general names for people, places or things. E.g teacher, city, book.\n3.  **Collective Nouns**: These are groups of people, animals or things. E.g family, flock, team.\n4.  **Abstract Nouns**: These are nouns that you can't touch or see but you can feel it. E.g Love, peace, happiness, sadness, pain.\n\n---\n\n#### Class-work\n\nUnderline the noun(s) in the sentences.\n\n1. The tall **boy** pushed his **sister**.\n2. We travelled to **School** in the **car**.\n3. I love going to **Wexford** on **holiday**.\n4. I tidied the **cushions** on the **sofa**.\n5. **Farmers** look after their **cattle**.\n6. I have a **brother** and **sister**.\n7. I saw a **rosebush** in the **garden**.\n\n---\n\n### English-language 22/5/2025\n\n#### Pronouns\n\nPronouns are words that takes the place of a noun.\n\n#### Types of pronouns\n\n1.  **Personal pronouns**: It replaces nouns in a sentence. For example: I, you, he, she, it, we, they, us.\n2.  **Possessive pronouns**: It shows ownership or possession. For example: Mine, ours, yours, his, hers, its, theirs.\n\n#### Class-work\n\nWrite out ten sentences using pronouns.\n\n#### Home-work\n\nWrite out ten sentences using pronouns.\n\n---\n\n### ENGLISH\n\n#### VERBS\n\nVerbs are words that show action or what someone or something is doing.\n\nThere are different types of verbs namely:\n*   **Action verbs**: show physical or mental action (e.g run, think, read, learn, remember)\n*   **Linking verbs**: Connects the subject to additional information (e.g is, seems, appears, becomes)\n*   **Helping verbs**: Used with m..."
  },
  {
    "subject": "Basic Science and Technology",
    "content": "### B.S.T 20/5/2025\n\n#### Examples of Underdeveloped and Developed Technology\n\n|                     | Underdeveloped Technology | Developed Technology |\n|---------------------|---------------------------|----------------------|\n| Food Processing     | Grinding stone            | Blender              |\n| Cooking of food     | Firewood                  | Electric cooker      |\n| Accommodation       | Mud house or Hut          | Storey building      |\n| Source of Water     | Well water                | Pipe-borne water     |\n| Transportation      | Horse-drawn Carriage      | Aircraft             |\n| Communication       | Gong                      | Radio                |\n\n---\n\n### PLANTS 22/5/2025\n\nPlants are living things that can grow, move and reproduce.\n\n#### Reasons why plants are living things:\n1. plants are sensitive to touch or sunlight.\n2. plants need air to survive.\n3. plants have the ability to reproduce.\n4. Plants feed on the food substances in the soil. E.g nutrient, water.\n5. Plants are able to move their parts.\n6. Plants have the ability to excrete i.e the ability to remove unwanted substance.\n\n---\n\n### B.S.T. 26/5/2025\n\n#### Light Energy\n\nLight energy is a form of energy that illuminates places.\n\nGreen plants use light to make their food.\n\nLight travels in a straight line.\n\n**Examples of Light Energy**\n*   **Sunlight**: The sun gives us light energy which helps plant grow and makes our days bright.\n*   **Bulbs**: Light bulbs in our homes and schools give off light energy, helping us see in the dark.\n*   **Stars**: The stars in the night sky give off light energy, twinkling like diamonds.\n\n---\n\n### B.S.T\n\n#### SOURCES OF LIGHT\n\nAny object that gives light is called a SOURCE OF LIGHT.\n\nWe have two main sources of light energy. They are:\ni. Natural Source\nii. Artificial Source\n\n- **Natural Sources**: Sun and other stars.\n\n- **Artificial Sources**: They are;\n  - Gas light\n  - Electric B..."
  },
  {
    "subject": "Computer",
    "content": "### I.C.T\n\n#### INPUT DEVICES\n\n**JOYSTICK**\n\nThe Joystick is used to play computer games. It is an input device used to select and control items and images of computer games.\n\n**MONITOR**\n\nThe monitor has a rectangular screen (Face) like a television. It is used to show words, pictures and films from the computer.\n\n**PRINTER**\n\nThe printer is an output device and is shaped like a box. The printer is used to transfer data such as text, pictures, charts, table and sketches from the computer to paper.\n\n**SPEAKER**\n\nA speaker is used to transfer sound from the computer. It can be used to listen to music from the computers.\n\n---\n\n#### COMPONENTS OF A SYSTEM UNIT\n\nThe system unit is made up of devices, but chief among them are Central Processing unit (CPU), disk drive and motherboard.\n\n#### DRIVES IN CPU\n\nThe system unit is often called CPU as it is the major component. It has CD/DVD disk drive, floppy disk, flash drive and hard disk drive.\n\n#### PARTS OF A CENTRAL PROCESSING UNIT\n\nThe CPU is made up of the control unit (CU), random access memory (RAM) and arithmetic and logic unit (ALU).\n\nThe CPU is what makes the computer work.\n\n#### FUNCTIONS OF THE CPU\n\ni) CPU stores data in the memory unit.\nii) CPU does all computer operations.\niii) CPU controls all the activities of the computer.\niv) CPU performs arithmetic calculations.\nv) CPU performs logical operations.\n\n---\n\n#### STORAGE DEVICES\n\nStorage devices are computer devices that store data and information for future use.\n\nThe following are examples of computer storage devices:\ni) Flash drive\nii) Hard disk\niii) Compact disk (CD)\niv) Floppy disk\nv) Digital video disk (DVD)\nvi) Magnetic tape\n\n#### DIFFERENCES BETWEEN STORAGE DRIVE AND DISK\n\nA storage disk stores information from the computer by using a storage drive. The following are the differences.\n\n| Storage drive | Storage disk |\n|---|---|\n| 1. It uses electricity | it does not use electricity |\n..."
  },
  {
    "subject": "Physical and Health Education",
    "content": "### P.H.E. 20/5/2025\n\n#### SAFETY RULES IN BALL AND RACKET GAMES\n\n1. Always use the right sports wear for each ball game.\n2. You must inspect the play area before you start the game.\n3. Do not play on slippery ground or wet floor.\n4. Do not chew gum or have anything in your mouth like toothpick while playing.\n5. Do not get involved in a fight with other teams or players.\n6. You must warm-up before you start the game.\n7. If you get tired in the course of the game, come out.\n8. If you feel pain in any of your joints or muscles, stop playing right away.\n\n---\n\n### P.H.E 26/5/2025\n\n#### Noise pollution\n\nPollution occurs when the environment is filled with harmful substances or materials which are dangerous to the health of people.\n\nNoise pollution is a loud, surprising, irritating or unwanted sound. Any noise that is unpleasant, undesirable and irritating to the human ear is called noise pollution.\n\n---\n\n#### PREVENTION OF NOISE POLLUTION\n\nThe following are ways we can prevent noise pollution.\n1. Car horns should not be used unnecessarily.\n2. Music should not be played at a high volume.\n3. Government should put in place laws that bans noise pollution.\n4. Cars and motorcycle engines should be turned off when they are not in use.\n5. Grinding machines and generators should be kept far from where people live.\n6. Industries should not be built close to residential houses.\n7. Use of fireworks that produce loud sounds should be discouraged.\n\n---\n\n### 6TH WEEK\n\n#### P.H.E\n\n#### CHEMICAL POLLUTION\n\nChemical pollution is the release of dangerous materials or substances into the environment. Such dangerous chemical substances or materials are harmful to people and animals.\n\nExamples of some substances that cause chemical pollution are smoke from factories, homes, cars, generators, burning refuse and flaring of gases.\n\n#### PREVENTION OF CHEMICAL POLLUTION\n1. Educate people on the dangers of pollution and the methods of disp..."
  },
  {
    "subject": "National Values",
    "content": "### Social-Studies 22/5/2025\n\n#### COMMON DRUGS IN OUR COMMUNITY AND THE RIGHT PEOPLE TO GIVE THEM.\n\nDrugs is any substance apart from food and water, that when taken can change the normal physical and mental functions of the body.\n\nDrugs are normally used to cure illness but they can also be abused for other purposes.\n\n#### SOME COMMON DRUGS AND THEIR PURPOSES\n\n| NAME OF DRUGS | PURPOSES |\n|---|---|\n| 1. Aspirin | To treat headache, pain. |\n| 2. Daga | To treat headache and body pains, toothache. |\n| 3. Nivaquine | used to treat malaria. |\n| 4. Panadol | To treat headache and body ache. |\n| 5. Paracetamol | To treat headache and body pain. |\n\n#### TRADITIONAL HERBAL DRUGS\n\nAlso called naturally occuring drugs, they are derived from natural substances such as plant, animals, chalk and charcoal.\n\n---\n\n#### Traditional herbal drugs\n\n**Classification/forms of drugs**\n1. Syrup\n2. Ointment\n3. Injection\n4. Tablet\n5. Capsule\n6. Inhaler\n\nUnlike modern (orthodox) drugs that further processes and refines substances, traditional (orthodox) drugs are usually served in their natural form. Most traditional drugs come in herbal forms such as leaves, roots and barks of trees.\n\n#### DIFFERENCES BETWEEN MODERN (SYNTHETIC) AND LOCAL (HERBAL) DRUGS\n\n| MODERN | TRADITIONAL |\n|---|---|\n| 1. They are artificially processed | They occur naturally and are usually administered in their natural state. |\n| 2. It normally comes in doses | Often administered without strict compliance with dosage. |\n\n---\n\n| MODERN | TRADITIONAL |\n|---|---|\n| 3. The active ingredients of plants are extracted for medical purposes | The entire plant is used for medicinal purposes. |\n| 4. Contains synthetic (artificial) substances like chemicals and preservatives | They are usually preserved naturally. |\n| 5. Comes with expiry date | Most herbal drugs do not have specific expiry date. |\n\n---\n\n### Social-Studies 26/5/2025\n\n#### Drug-Abuse\n\nDrug-abuse is..."
  },
  {
    "subject": "PreVocational Studies",
    "content": "### P.V.S 22/5/2025\n\n#### Wood and its uses\n\nWood is a product that is being gotten from timber.\n\nA timber is a tree found in the forest. Woodwork is the activity which involves the use of making structures and ornament out of wood can be made from wood.\n\nWoodwork can also be referred to as the art of using wood to get many home appliances such as furniture. Woodworks are usually done by the woodcarvers and carpenters.\n\nThe timber is commonly used for making woodwork and is being fell down in the forest by lumber-jack.\n\nA lumber-man is the person that cuts down trees and carries it to the sawmill.\n\nThere are different types of timbers which are:\n1. Iroko\n2. Abora\n3. Ebony\n4. Mahogany\n\n---\n\n#### USES of WOOD\n\n1. Woods can be used for making door and window frames.\n2. Wood can also be used in making certain items such as pestle and mortar and hangers.\n3. Wood can also be used for making furniture such as: Chair, table, Drawer, Desk, Bed, Shelves, cabinet, cupboard.\n\n---\n\n### P.V.S 26/5/2025\n\n#### GOODS\n\nGoods are outputs which give satisfaction to people when used or eaten.\n\nThere are two types of goods namely:\n- Consumer goods\n- Producer goods\n\n**Consumer goods**: are goods that are produced and taken to users for direct eating or consumption. They are produced and bought by individuals for personal use. E.g Chocolate, biscuits, sweet, garri, pepsi, bread, coca-cola e.t.c.\nThere are also consumer durable goods which are goods with long-term use. e.g Computers, television, refrigerators.\n\n**Producer goods**: are goods that are used to produce other goods. They are not for immediate use but are for further production. e.g raw materials, cotton, basket, suit e.t.c.\n\n---\n\n### P.V.S\n\n#### TEACHING AS A PROFESSION\n\nTeaching is a vocation that ensures the passing of knowledge and ideas from the teacher to the learners.\n\nThe person that does the teaching is called a teacher. The teachers are known as people who t..."
  },
  {
    "subject": "Civic Education",
    "content": "### Civic-Education 26/5/2025\n\n#### HIGH-WAY CODES\n\nHighway codes are rules that help us stay safe on the roads. These are the rules, regulations and symbols designed to ensure safety on our roads and highways.\n\n#### ROAD-SAFETY RULES\n\n1.  **Look Left, Right and Left Again**: Before crossing the road, look left, right and left again to make sure no cars are coming.\n2.  **Use crosswalks**: Use designated cross-walks or pedestrian crossings to cross the road.\n3.  **Hold Someone's Hand**: When walking on the road or crossing, hold someone's hand, especially if you're a kid.\n4.  **Wear Bright Colors**: Wear bright or reflective clothing so drivers can see you.\n5.  **Follow Traffic Lights**: Red means Stop, green means go, and yellow means get ready to stop.\n\n---\n\n### N.V (Civic-Education)\n\n#### IMPORTANCE/ADVANTAGES/BENEFITS OF HIGHWAY CODES\n\n1. They safeguard lives and property on our roads.\n2. They help to promote responsible, orderly use of the roads.\n3. They guide drivers, cyclists and other road users on proper use of our roads.\n4. They help to ensure that reckless drivers are arrested and punished.\n\n---\n\n### 6TH WEEK\n\n#### N.V (Civic-Education)\n\n#### EXAMPLES OF SIGNS AND MEANING\n\n1. **PEDESTRIAN CROSSING**, ALSO KNOWN AS Zebra Crossing. It is a sign that all vehicles including bicycles, motor-cycles, cars should stop and give way for pedestrian road users.\n2. **NO ENTRY**. It is used to inform road users that they are on the wrong way. It also helps to indicate that a road is one way only.\n\n### 7TH WEEK\n\n#### N.V (CIVIC-EDUCATION)\n\n#### SECURITY\n\nSecurity refers to safety, well-being, freedom and peace. It is the protection from dangers to life and property.\n\nSecurity is very important in the development and progress of any nation. Without security, it would be difficult for people to properly carry out their economic, social and political activities.\n\n---\n\n### 8TH WEEK\n\n#### N.V (CIVIC-EDUCATION)\n\n####..."
  }
]