[
  { "subject": "nv", "content": "Week 1 & 2\nNational Values\nReasons for taking substances into the body\nPeople take substance into their body for the following reasons\n1. Drugs keep people alive.\n2. Food and other substances keep hunger away.\n3. People takes soft drinks for enjoyment.\n4. Some people take substances because they see others taking them.\n5. Some people take some substances out of curiosity. They want to know what the substances taste like.\n\nNational Values (Week 3)\nOverdose\nOverdose means to take too much food or drink. It is a bad habit that a good pupil must avoid always.\nSigns of Overdose\n1. Stooling\n2. Vomiting\n3. Fainting\n4. Sleeplessness\n5. Stomach-pain\nEffect of taking too much food, drink and smoke\nWhen a person drinks too much, he urinates frequently.\n2. A child who drinks too much water before going to bed usually bed-wet.\n3. An adult who drinks too much alcohol becomes drunk.\n4. Too much smoke can make someone faint.\n\nWeek 4\nNational Values\nWays of helping somebody who takes overdose\nA person who is suffering from too much food, drink or smoke should be taken to the hospital immediately. When a person faints, apply first aid to bring him back to life.\nReport a child who smokes or drinks alcohol to the teacher and the parents.\nActivities\n1. What are the effects of drinking too much?\n2. What happens to a person who inhales too much smoke?\n3. How can you help people who suffer from the effects of too much eating, drinking and inhaling smoke?\n\nNational Values\nFood\nFood is what we eat to grow, stay alive, have energy. Examples of food items: bread, eggs, yam, garri, rice, beans, millet, mango, carrot, fish, meat, banana and orange.\nWhere we get food in the community\nWe get our food from the farm. We buy some food items in the market. We get meat from cows, goats, sheep, hens and other animals. We get fish from the rivers and lakes and fish ponds.\nActivities\n1. What is food?\n2. Mention five food items eaten in the locality.\n3. Mention the sources of the food items found in the community.\n\nNational Values\nFood Safety\nFood safety means making sure that what we eat or drink is not harmful to our health.\nWhat to do to have food safety\n1. Wash your hands before and after food preparation.\n2. Read food labels before cooking and eating.\n3. Cover all food items in the kitchen.\n4. Cook the food properly.\n5. Clean the kitchen environment.\nActivities\nWhat is food safety?\nHow can you ensure food safety?\n\nNational Values\nRisk factors in food\nRisk factors are those things that cause danger to us.\nExamples of Risk factors in food\n1. Adulteration\n2. food fraud\n3. agrochemical\nCauses of risk factors in food distribution and preparation\n1. poor hygiene\n2. poor handling\n3. poor storage conditions\n4. poor kitchen utensils.\nActivities\n1. What are risk factors in food?\n2. Mention three examples of risk factors in food.\n\nWEEK 8\nNational Values\nSources of Water\nWater is a liquid that has no colour, no smell and no taste. We get water from different places.\nSources of Water\nStream water\nSpring water\nRiver water\nBorehole water\nTap water\nWell water\nRain water\nActivities\nWhat is water?\nMention five sources of water.\n\nNational Values\nUses of Water\nWe use water to do the following things:\n1. We drink water.\n2. We wash clothes with water.\n3. We cook with water.\n4. We wet flowers with water.\n5. We make soap, butter, biscuits and other products with water." },
  { "subject": "pvs", "content": "PVS\nThe Home\nA home is a place where members of a family live. Home is different from house because house is a building which is the home for a family. A home may be for nuclear or extended families. Home is a place of shelter for a family.\nItems found in different parts of a home are:\nTelevision\nRadio\nTable fan\nGas cooker\nCeiling fan\n\nP.V.S.\nDifferent part of a home and their Uses\n1. Living room or sitting room: This is a place where we entertain visitors, where we relax and watch television.\n2. Dining room: This is a room where we eat.\n3. Bedroom: This is a room where we sleep.\n4. Kitchen: This is where foods are prepared.\n5. Toilet: We use the toilet to urinate or defecate.\n6. Bathroom: This is where we take our bath.\nPart of a home and items found in them\nDining room: Dining chairs, Dining table spread and cover, glass cup, mugs, forks, spoon etc.\nBedroom: Bed, Bed sheet, mattress, wardrobes, Dressing mirror, pillow.\nKitchen: Gas cooker, electric cooker, cupboard, kitchen utensils, fridge and freezer.\nBathroom and toilet: Sink, water bucket, buckets, sponge, soap, toothpaste, toothbrush, wash basin etc.\n\nPVS\nToilet Hygiene\nA toilet is a place where we pass urine, pass faeces or defecate. Toilet is one of the parts of a home. In Nigeria, people make use of different types of toilets.\n\nPVS\nTypes of toilet\nBelow are the types of toilets used in the olden days and at present\n1. Hole toilet\n2. pit latrine\n3. Sink and Water closet\n4. Bucket toilet\n\nPVS\nItems in a toilet\nA toilet must have the following items:\n1. Bucket and water\n2. Soap and detergents\n3. Broom\n4. Towel\n5. Disinfectant - liquids\n6. Tissue paper\n7. Hand wash basin\n8. Scrubbing stick\nProper use of the Toilet\nThe following are proper ways to use toilets.\na. Sit properly on water closet\nb. flush the toilet after use\nc. clean properly with water or tissue paper after using the toilet.\nd. Wash your hands with soap and water after using the toilet.\n\nPVS\nTypes of Dirt\nDirt are pieces of refuse which litter our surroundings. The following are the types of dirt:\n1. pieces of paper and card\n2. leaves and flowers\n3. Rags\n4. Dust\n5. Cobwebs\n6. Nylon of sachet water\n7. Empty packs, boxes and cartons\n8. polythene bags\n9. food remnants\n10. Broken bottles\n\nPVS\nGood feeding habits\nGood feeding habits mean what you are allowed to do before, during and after eating. The following are good feeding habits:\n1. Eat in a clean place.\n2. Wash your hands before and after eating.\n3. Do not put too much food into your mouth.\n4. Use your right hand to eat.\n5. Do not talk while eating.\n6. Chew the food in your mouth before swallowing it.\n\nPVS\nLand and its uses\nLand is the part of the earth's surface covered with soil. It is an area of ground.\nTypes of land\n1. Rocky land: This is a land with rocks.\n2. Swampy land: This is a land that has so much water where plants grow.\n3. Dry land: This is a land that has little water.\nUses of land\n1. We plant crops on land.\n2. Farm animals move on land.\n3. Road is constructed on land.\n4. We build houses on land.\n5. Human beings live on land.\nActivities\nMake a list of different things found on the land.\n\nPVS\nThe Sun and its uses\nThe Sun is an object that is far away from the earth and shines above the earth. The sun rises in the morning to provide light. The sun sets in the evening to usher in night. The energy from the sun is called solar energy.\nUses of the Sun\nThe sun is use for the following purposes:\n1. It provides daylight.\n2. It is used to dry crops like maize, beans, pepper etc.\n3. It makes plants to grow well.\n4. It warm our body.\nEvaluation\n1. When does the sun rise?\n2. When does the sun set?\n3. Energy from the sun is called __" },
  { "subject": "h", "content": "History\nHeroes and Heroines in our Community\nProfessor Wole Soyinka. He is the first African who won Nobel prize in literature in 1986. Soyinka was born into a Yoruba family in Abeokuta on 13 July, 1934. He is regarded as one of the best poets, play wrights and essay writer who have been imprisoned for many years. He also played active roles in Nigeria's political history and its struggle with British Colonization.\n\nHistory\nChief Anthony Enahoro\nHe was born on 22 July 1923. Chief Anthony Enahoro was one of Nigeria's leading anti-colonial and pro-democracy activist. He had a long experience in publishing, politics and pro-democracy Movements. Chief Anthony Enahoro became the first Nigerian to move the motion for Nigeria's Independence which was eventually granted in 1960.\n\nHistory\nHistory of Alhaja Kudirat Abiola\nAlhaja Kudirat Abiola was the wife of late Chief M.K.O. Abiola. Her husband won the presidential election held on June 12, 1993. She stood by her husband. She was killed in 1996 while her husband was in prison. She wanted Nigeria to be free from military rule. She fought for government of the people, by the people and for the people.\n\nHistory\nTraditional Rulers\nA traditional ruler is a cultural leader who protects the traditions and culture of his people. A traditional ruler is the head of an ethnic unit or clan whose title is recognised by government of the state.\nTitles of traditional rulers\nEmir, Lamido, Shehu (Hause land)\nOba (Yoruba land)\nEze, Igwe and Obi (Igbo land)\n\nHistory\nRoles of Traditional Rulers\n1. Custodian of culture and other domains.\n2. They settle land and marriage quarrels.\n3. They support good leaders.\n4. They educate the people to do their civic duties like voting, pay tax.\n5. They punish bad behaviour.\n6. They make people to obey law and order in the community.\n\nHistory\nTraditional Title Holder\nA traditional title holder is the head of a tribe. It is someone who is appointed by a traditional ruler like Oba, Emir or Obi to assist or advise him on issues affecting the community.\n\nHistory\nVarious Traditional Titles in the Community\nHausa traditional titles and their meanings\nTraditional Titles | Meaning\n1. Galadima | The administrator of capital territory\n2. Waziri | The Emir's prime minister\n3. Turaki | Intelligence with interest in business and finance\n4. Madawaki | The commander-in-chief\n5. Megaji | The treasurer of government\n\nHistory\nIgbo Traditional titles and their meanings\nTraditional titles | Meaning\nEbube Dike | Glorious hero\nIkemba | Strength of a nation\nOke Osisi | Great tree\nOme Loba | One who does everything good for everyone\nOme Ego | Wealth and philanthropist" },
  { "subject": "phe", "content": "PHE\nCare of parts of Our Body\nTaking care of the body is very important for good health.\n1. Do not use a sharp pointed object to clean your ears. It may damage your ears.\n2. Do not use your teeth to cut your nails.\n3. Clean your teeth every morning and after each meal with a toothbrush and toothpaste.\n4. Do not use a broomstick or sharp object to pick your teeth after eating.\n\nPHE\nGood personal Health Habits\nGood personal health habit is keeping our body clean and living in a clean environment.\nGood personal health habits\n1. Wash your hands before eating.\n2. Wash your hands after eating.\n3. Wash your hands after leaving the toilet.\n4. Always drink clean water using a clean cup.\n5. Always wash your fruits before eating them.\n\nPHE\nBenefits of Cleanliness\nThere are many benefits for maintaining personal hygiene and cleanliness.\n1. It helps to prevent the development and spread of infections and pain.\n2. It prevents illnesses and bad odour.\n3. It makes us more attractive to others.\n4. Good hygiene practices will help to keep you healthy.\nActivities\nDescribe how to wash hands, take a bath and care for the skin.\nDemonstrate how to brush the teeth.\nWhat happens when we take care of our body?\n\nPHE\nFirst Aid\nFirst aid is the first help given to a sick or injured person.\nWe keep some medicine in the box. We must keep first aid boxes at home, in the school and in our cars.\n\nPHE\nObjectives of first Aid box\nFirst aid is given to stop bleeding, to save life, to prevent an injury from becoming worse and to prevent shock.\nConditions that require first Aid\n1. Bleeding\n2. fainting\n3. Bruises\n4. Heat burns\n5. Fracture\n6. Animal bites and stings\n7. poisoning\n\nPHE\nContents of a first Aid box\nThose things in the first Aid box are the contents of a first aid box. They are:\n1. bandages\n2. gloves\n3. Disinfectant\n4. Scissors\n5. Soap\n6. Cotton wool\n7. pain relieving tablet\n\nPHE\nSafety\nSafety is freedom from danger. It is not getting hurt, wounded.\nExamples of things we should not play with are:\n- Snake\n- blade\n- gun\n- fire\n- syringe\n- deep well\n\nPHE\nSafety Rules\nSafety rules are those things you do to be safe. The following are safety rules:\n1. Avoid playing with dangerous things such as electric wires.\n2. Keep away from places that are not safe, for example rivers, high hills, busy roads.\n3. Avoid doing dangerous things like: climbing trees, playing with nails, cutlasses, blades and pins." },
  { "subject": "rs", "content": "CRS\nThe Birth of Jesus\nMary became pregnant through the holy Spirit. When it was time for her to give birth, the government announced that they wanted to count the number of people in Israel. Joseph now took Mary his wife to Bethlehem where he came from to be counted. While they were there, It was time for Mary to give birth. There was no more room in the inn. They went to the manger where sheep were kept. It was there she gave birth to Jesus Christ.\nHomework\nComplete this verse (Luke 1:30-31)\n\"Fear not Mary, for thou has found\"\n\nCRS\nWhy Jesus Came\nJesus came to the world to save us, to deliver us from the hand of Satan and he died for our sins.\nWays in which God protected Jesus\nDuring the birth of Jesus, there was a king named Herod. He was furious when he heard about the birth of the savior. He sought ways of killing him, but God protected Jesus by: By telling Joseph to take baby Jesus and his mother to Egypt till the death of Herod who was planning to kill him.\n\nCRS\nJesus Calls the Little Children\nWhen little children were brought to Jesus, he laid his hand on them, and prayed for them and carried them on his lap. His disciples were about to rebuke the parents who brought the children but Jesus told them not to send them away for the kingdom of God belongs to those who believe like children.\nJesus Disciples\nJesus calls his disciples his friends.\nHis disciples are:\n1. peter\n2. Andrew\n3. John\n4. James\n5. Bartholomew\n6. Matthew\n7. Thomas\n8. Simon\n9. Thaddeus\n10. Judas Iscariot\n11. philip\n\nWEEK 6\nCRS\nThe Death and Resurrection of Jesus\nJesus was crucified on the cross at the third hour of the day. And hours later, he died. After his death on the cross, a man called Joseph of Arimathea, a counselor, went to pilate to ask for the body of Jesus to be released to him. He took the body of Jesus wrapped him and put him in tomb. On the third day Jesus risen from the death.\nMemory Verse (John 24:7)\n\nCRS\nHow to Become a Christian\nA Christian is someone who believes in Jesus and follows Him as his or her personal Lord and Saviour.\nSteps to Become a Christian\n1. We must accept the message of Jesus.\n2. We must confess our sins and promise not to sin again.\n3. We must be baptized in the name of the father, the son and the Holy Spirit.\nActivities\nWho is a Christian?\nHow can you become a Christian?" },
  { "subject": "cca", "content": "CCA\nCeremony\nA ceremony is the coming together of people to celebrate an event. There are lot of food, drinks during a ceremony.\nTypes of ceremonies\nThere are four types of ceremonies\n1. Traditional ceremony. e.g tradition marriage, naming ceremony etc.\n2. Religious ceremony. e.g christmas, Easter, Sallah\n3. National ceremonies. e.g Independence, Democracy day\n4. Carnivals: This is a colourful celebration where people come together to eat, drink, playing games, music - e.g Abuja and Calabar carnivals.\n\nCCA\nImportance of Ceremonies\n1. Ceremonies help to unite the people.\n2. They promotes culture of the people.\n3. They help in educating the youths about the society.\n4. They help to strengthen relationships.\n5. They encourage love and sharing among the people.\n6. They help economic development through tourism.\nHomework\nWhat is ceremony?\n2. Mention the types of ceremonies we have.\n3. Give an example of a religious ceremony.\n\nCCA\nMusic Song\nA song is a group of sounds that are nice to the ears made by our voices when we sing.\nWhy we sing song\n1. We sing song to show the love for our country.\n2. We sing song to praise God.\n3. We sing songs in times when we are sad.\nMusical instruments\n1. drums\n2. flutes\n3. guitars\n4. piano\n\nCCA\nThe Letters of Music\nMusic has seven letters. They are also called the alphabet of music. They are A B C D E F G" },
  { "subject": "bst", "content": "Basic Science\nSimple Machines\nA machine is a device that makes work faster and easier.\nExamples of Simple Machines\n1. Spoon\n2. Bottle Opener\n3. Broom\n4. Hammer\n5. Cutlass\n6. pliers\n7. forks\n8. Sickle\n9. Windlass\n10. Wheel barrow\n\nWeek 3\nBasic Science\nAdvantages of using Simple Machine\n1. It makes work fast.\n2. It makes work easy.\n3. It saves time.\n4. It saves energy.\n5. It help us to do more work.\n\nTuesday/Wednesday 28 May 2025\nBasic Science\nSafe use of Simple Machines\nUse a knife carefully\nDo not use a knife carelessly.\nHold the knife the correct way.\nGive a pair of scissors to someone carefully.\n\nBasic Science\nMaterials for making simple machines\nMachines are made of different materials. These materials include:\n1. Steel\n2. Wood\n3. Plastic\n4. Rope\n5. rubber\nExamples of machines and the materials used in making them are:\nMachine - Materials\nScissors - metal and plastic\nbroom - Raffia\nCatapult - wood and rubber\n\nBasic Science\nMeaning of Energy\nEnergy is the ability to do work. We need energy to wash our clothes, work on the farm, carry load, cook our food, walk and bathe.\n\nBasic Science\nThings that uses Energy\nThe following are the things that use energy\n1. Stove\n2. heater\n3. torch\n4. fridge\n5. bulb\n6. television\n7. fan\n\nBasic Science\nUses of Energy\n1. Energy is use to do different things.\n2. Energy is use for washing our clothes.\n3. for lifting heavy objects.\n4. for fetching water from the well.\n5. for doing our work.\nQuestions\nState the meaning of energy.\nName four items that make use of energy." },
  { "subject": "c", "content": "Computer Science\nCommon Information Technology (IT Devices)\nIT devices are used to pass information from one person to another and from one place to another.\nExamples of Common Information Technology Devices\n1. Calculator\n2. Radio\n3. Wrist Watch\n4. Television\n5. The Computer System\n6. A mobile phone\n7. A digital camera\n\nComputer Science\nDescription of Common Information Technology (IT) Devices\nTelevision: A television allows us to watch cartoons and news. It has buttons for changing channels and the volume.\n[Drawing of a TV]\nLG\nA Television\n\nWeek 4\nComputer Science\nCommon IT Device: Radio\nRadio: A radio passes audio sound programmes and messages to the public. It has an antenna for receiving sound messages and a knob for turning to different stations. It also has a speaker through which sound is passed.\n\nComputer Science\nCalculator: A calculator performs addition and subtraction of numbers. It has a small screen where you see numbers which have been pressed from the keypad.\n\nComputer Science\nIT Device: Computer\nComputer: A computer is an electronic device that processes data and gives information. It has a monitor where you see what has been entered from the keyboard and a system unit that connects all other devices.\n\nWEEK 7\nComputer Science\nIT Device: Digital Wristwatch\nDigital wristwatch is worn a stripe around the wrist. A watch displays the time in numbers. It has the hour, the minute and the second.\n\nComputer Science\nMobile GSM phone\nA mobile phone is a small radio telephone that is used to communicate among people at long distances. It has a small screen and a number of keys to dial phone numbers." },
  { "subject": "e", "content": "Composition\nMy Mother\nThe name of my mother is Mrs Sandi Seriki. She is 38 years old. She is short and fat. My mother is black in complexion. Her face is round. She has black hair.\nHomework\nWrite a composition about your mother.\n\nA Hospital\nA hospital is a place where sick people are treated. Sick people in the hospital are called patients. Doctors and nurses take care of sick people in the hospital.\n\nGrammar\nCapital letters\nWe use capital letters to begin people's names. We also begin the days and month with capital letters.\nAfiong, Nosa, Monday, Tuesday, May, December\n1. Afiong was born in April.\n2. He comes here on Fridays.\n3. Nosa was not in school on Tuesday.\n4. August is the eight month of the year.\n5. My best day in the week is Wednesday.\nClasswork\nUse capital letters to make these sentences correct.\n1. ada is in a beautiful dress.\n2. Musa and Isa always read their books.\n3. Our teacher's name is mrs ekpe.\n4. school begins on monday.\n\nGrammar\nPronouns\nPronouns are words use instead of a noun.\nExamples of pronouns\nShe, I, They, Him, We, He, It, Her, Them, me\nExamples:\nTola is a boy.\nHe is a boy.\nNgozi is a girl.\nShe is a girl.\nThis watch is very fine.\nIt is very fine.\nClasswork (Change the nouns to pronoun)\n1. Adams is a nice boy. (He)\n2. Mary can sing well.\n3. The cat walks slowly.\n4. Odiete and Anum are pupils.\n5. Musa is an intelligent boy.\nHomework\nChange the underline nouns to pronoun.\n1. My father bought a shirt from the market.\n2. Mariam has a beautiful voice.\n3. John is brilliant.\n4. The dog barks harshly.\n5. Eva sings like an angel.\n\nWeek 5\nGrammar\nPresent Continuous tense\nPresent continuous tense is used for actions or events happening now.\ne.g You are learning English now.\nI am standing alone on the narrow road.\nThey are reading their books.\nHe is swimming.\nClasswork\nAdd 'ing' to these words to make sentences.\n1. The baby is crying.\n2. The teacher is writing.\n3. The children are playing.\n4. The boys are swimming.\n5. Shhh! Granny is sleeping.\nHomework\nAdd 'ing' to these words to make sentences.\n1. Umana is riding a bicycle.\n2. The girls are running.\n3. Aanu is drinking water.\n4. The trader is selling water.\n5. The mechanic is repairing the car.\n\nComposition\nThings I do everyday\nComplete the sentences below with what you do every day.\n1. I ___ help my mother to ___ every day.\n2. I ___ football every day.\n3. I ___ my teeth every day.\n4. I ___ my book every day.\n5. I ___ my food every day.\n6. My friends and I ___ to school every day.\n\nGrammar (Monday)\nAbbreviations\nAn abbreviation is the short form of a word. Examples are:\nDr. = Doctor\nMr = Mister\nMrs = Mistress\nProf. = Professor\nRev. = Reverend\nEngr. = Engineer\nFr. = Father\nClasswork\nCopy the following correctly in capital letters.\n1. Early to bed, early to rise.\n2. A word is enough for the wise.\n3. Givers never lack.\n4. Look before you leap.\n5. A cheat never does well in life.\nHomework\nWrite the abbreviation of the following words\n1. professor\n2. Reverend\n3. Engineer\n4. Mister\n5. Mistress\n\nGrammar (Tuesday)\npunctuation\n, . ?\nComma, full stop, Question mark\n1. We use a comma to seperate two or more items in a sentence.\nExample: The colours in Nigeria's flag are green, white, and green.\n2. We use full stop at the end of a statement.\nExample: Mothers love their children.\n3. We use a question mark at the end of a question.\nExample: What is your name?\nClasswork\nuse a comma, full stop or a question mark to complete each sentence.\n1. Amina loves to help her mum cook lunch.\n2. Where are you going?\n3. Do you like cakes?\n4. My toy is big.\nHomework\nUse a comma, full stop or a question mark to complete each sentence.\n1. My toy is big.\n2. I can see a car.\n3. My sister has three friends. They are Maryam, Ezinne and Shade.\n4. Have you seen my bag?\n\nGrammar\nPreposition\nA preposition is a word that is used to show place, time, and direction.\nExamples of preposition\n1. near\n2. below\n3. under\n4. behind\n5. above\n6. in\n7. on\nSentences\n1. The stick is in the pot.\n2. The yam is under the table.\n3. The basin is on the box.\nClasswork\nWrite five sentences using preposition. Underline the preposition in the sentence.\nHomework\nWrite five sentences using preposition.\n\nGrammar\nAntonyms\nAn antonym is a word that has an opposite meaning to another word.\nExamples:\nOld - young\npull - push\nman - woman\nfast - slow\nwet - dry\nsmall - large\nlight - dark\nopen - shut\nClasswork\nCircle the opposite of the first word in each row. An example is given.\n1. right (wrong) hurt less\n2. near behind far first\n3. hot warm boil cold\n4. slow crawl fast move\n5. float run trap sink\nHomework\nDraw a line to match each word to its opposite\nA | B\npull | soft\nHard | cold\nhot | well\nsick | push\nfat | thin\nEmpty | full\n\nWEEK 9\nGrammar\nSimple present tense\nThe simple present tense is often formed using the base form of the verb, with the addition of -s or -es for singular person (he, she, it).\nExamples:\nBode washes plates\nFatima brushes her teeth\nI go to school\nShe studies English\nClasswork\nUnderline the simple present tense in the following sentences.\n1. Fatima sweeps the floor.\n2. Bode takes his bath everyday.\n3. Obi plays football everyday.\n4. My friends walk to school every day.\nHomework\nMake five sentences using simple present tense." }
]
