{
  "pvs": "Week 1 & 2\nFOOD\nFood is what we eat. It may be in liquid or solid form. Food makes us grow and remain healthy.\nTypes of food\na. Energy giving food: These are food that gives us energy. Carbohydrate e.g yam, Maize, Cassava etc.\nb. Body-Building food: These are food which supply us energy protein into our body. e.g beans, eggs, fish, meat, etc.\nc. Fatty food: These are food that provide fat and oil that help to repair damage cells in the body. e.g butter, vegetable oil, palm oil, groundnut oil, Cheese etc.\nd. protective food: these are food that protect the body against diseases e.g fruits and vegetable.\n\nBalanced diet\nA Balanced diet is the diet that contains all the classes of food. This means that the right amount of Carbohydrate, protein, vitamins and minerals must be present in the food we eat.\nExamples of Balanced diet\n1. Moinmoin with vegetable, fish served with pap or bread and juice drink.\n2. Rice and Beans served with boiled egg, fish or meat, stew and fruit juice.\n3. Boiled or fried egg served with bread and fruit juice.\n4. pounded yam served with vegetable and melon soup, fish, meat and juice drink.\nImportance of Balanced diet\n1. Balanced diet makes the body grow well.\n2. It gives us good health.\n3. Balanced diet protects the body from diabetes, heart diseases etc.\n4. When we have wound, it heals fast when we eat balanced diet.\n5. Balanced diet makes our bones and teeth strong.\n6. Balanced diet gives us energy and strength.\n\nBathing\nBathing is an act of washing our body with clean water, soap and sponge.\nWhen to take our bath\na. When we wake up in the morning.\nb. Before going to bed at night.\nc. After exercises.\nd. After working.\nMaterials used to wash our body.\n1. toilet soap\n2. Sponge\n3. Clean water\n4. Bucket\nReasons why we bath regularly\n1. We bath to be clean, neat and smell nice.\n2. To be free from body odour.\n3. Bathing keeps our skin fresh and smooth.\n4. Bathing removes rashes from our skin.\n5. Bathing allows us to have sound sleep.\n\nWeek 5\nThe Home\nHome is where each family in the society lives.\nFunctional rooms in the Home\na. Living room: A room where we recieve visitors.\nb. Dinning room: A room where we eat.\nc. bedroom: A room where we sleep.\nd. Kitchen: A place where we cook.\ne. Bathroom\nf. toilet\ng. Store: A place where we keep things.\nItems found in the home\na. furniture\nb. Refrigerator\nc. fan\nd. Beds\ne. Wardrobes\n\nHome furnishing\nfurnishing a home means providing wooden and decorated items to make a home comfortable.\nTraditional pieces of furniture\na. mat\nb. bamboo bed\nc. raffia mat\nModern pieces of furniture\n1. Upholstery chairs, centre table and stool\n2. sets of dinning chairs and table\n3. Beds, pillows, bedsheets\n4. Wardrobes, cabinet\n5. Kitchen cabinet and shelf\n6. shoe rack\n7. Dressing Mirror\n\nHarmful substances that can be taken into the body\nHarmful substances are certain food, drinks that we take that is dangerous to our body.\nExamples of Harmful substance\na. uncooked or raw food\nb. Rotten fruits and vegetables\nc. Alcohol\nd. Hard drugs\ne. cigarettes\nf. rat poison\nEffects of harmful substances on human body\n1. Body pain\n2. Stomach pain\n3. Stooling\n4. Restlessness\n5. Drunkenness\n6. Death.\n\nFood preservation\nFood preservation is the way food is treated or kept for it not to get spoil.\nMethods of preserving food\na. Yam tuber: Yam are stored in barns.\nb. Grains: These are preserved in sacks, baskets, or putting it under the sun.\nc. Meats: They are salted, smoked or sun dry.\nd. oil: They are stored in drums and big tanks.\ne. fruits: They are made into juice and stored in cans.\n\nMethods of handling leftover foods\nWe can preserve leftover foods in the following ways\n1. Drying\n2. Smoking\n3. freezing\n4. Boiling\n5. Canning\n- Drying: is done by spreading the leftover foods on boards or large nylon in the sun. e.g Cocoa, beans, cassava\n- Smoking: this is the process of using heat from the same firewood to smoke food. e.g meat, fish\n- freezing: This is the process of keeping foods in the freezer and fridge.\n- Boiling: Meat can be preserved by boiling with water and salt to prevent it from decaying.\n- Salting: This is the oldest way of preserving food. Salt can be applied on food to keep it preserved.\n- Canning: food can be seal in an airtight container called can, e.g Sardines, juice, vegetable, etc.\nEvaluation\nWhat is food preservation?\nList five ways food can be preserved.",
  "h": "Heroes and Heroines in our Community\nProfessor Wole Soyinka. He is the first African to be awarded Nobel prize in literature in 1986.\nSoyinka was born into a Yoruba family in Abeokuta on 13 July 1934.\nHe is regarded as one of the best poets, play wrights and essay writers who have been imprisoned for many times for criticizing Nigeria government. He also played active roles in Nigeria's political history and its struggle with British Colonization.\n\nHistory of the state\nWe have 36 states and the federal capital Territory in Nigeria. Each state has its own people and government. States are created for easy administration and to bring government closer to the people so that they can enjoy the benefits of the government.\nState | Capital | Year of Creation\n1. Abia | Umuahia | 27, August 1991\n2. Adamawa | Yola | 27, August 1991\n3. Akwa Ibom | Uyo | 23, Sept. 1987\n4. Anambra | Awka | 27, August, 1991\n5. Bauchi | Bauchi | 3, February, 1976\n6. Bayelsa | Yenegoa | 1, October, 1996\n7. Benue | Makurdi | 3, February, 1976\n8. Borno | Maiduguri | 3, February, 1976\n9. Cross River | Calabar | 27, May 1967\n10. Delta | Asaba | 27, August 1991\n11. Ebonyi | Abakaliki | 1, October 1996\n12. Edo | Benin | 27, August 1991\n13. Ekiti | Ado-Ekiti | 1, October 1996\n14. Enugu | Enugu | 27, August 1991\n15. Gombe | Gombe | 1, October 1996\n16. Imo | Owerri | 3, February 1976\n17. Jigawa | Dutse | 27, August 1991\n18. Kaduna | Kaduna | 27, May 1967\n19. Kano | Kano | 27, May 1967\n20. Katsina | Katsina | 27, May 1967\n21. Kebbi | Bini-Kebbi | 27, August 1991\n22. Kogi | Lokoja | 27, August 1991\n23. Kwara | Ilorin | 27, May 1967\n24. Lagos | Ikeja | 27, May, 1967\n25. Nasarawa | Lafia | 1, October 1996\n26. Niger | Minna | 3, February 1976\n27. Ogun | Abeokuta | 3, February 1976\n28. Ondo | Akure | 3, February, 1976\n29. Osun | Osogbo | 27, August 1991\n30. Oyo | Ibadan | 3, February, 1976\n31. Plateau | Jos | 3, February, 1976\n32. Rivers | Port-Harcourt | 27, May, 1967\n33. Sokoto | Sokoto | 3, February, 1976\n34. Taraba | Jalingo | 27, August, 1991\n35. Yobe | Damaturu | 27, August, 1991\n36. Zamfara | Gusau | 1, October, 1996\n\nTraditional Rulers and their titles\nA traditional ruler is an individual who is selected or chose as a leader according to the culture of a community.\nExamples of Traditional rulers in Nigeria\nObas\nEmirs\nObi\nSeriki\nDuties of Traditional Rulers\n1. Settle all disputes\n2. They keep their custom active\n3. They appoint chiefs\n4. They maintain peace and order\n5. They protect lives and property\nActivities\n1. Who is a traditional ruler?\n2. Mention the name and title of the king of your town.\n\nWEEK 7\nTraditional Occupations of the Hausa people\nthe traditional occupations of the Hausa are:\n1. farming\n2. Weaving and dyeing\n3. Leather works\n4. Livestock rearing\n5. Black smithing\nImportance of the occupations of the Hausas\n1. farming helps in the production of food\n2. Weaving and dyeing helps in the production of clothes\n3. Leather works produces shoes, belts, purse etc\n4. Livestock produce meat and milk for us\n5. Blacksmithing help to produce farm tools like cutlasses, hoes, knifes etc.\n\nTraditional Occupations of the People Of Nigeria - The Yoruba\nThe Yoruba practice various traditional occupations like:\n1. farming\n2. drumming\n3. palm wine tapping\n4. Hunting\n5. carving\n6. Mat weaving\nImportance of the occupations of the Yoruba\nFarming provide food.\nDrumming creates jobs.\npalm wine tapping brings money to palm wine tappers.\nHunting provide meat.\nCarving provides decorating items like vase, chair, tables etc.\n\nThird Term Begins. 20/5/202\nTowns in Nigeria\nThere are various towns in Nigeria located at various geographical territories. Some of these towns are ancient while some are modern. Both ancient and modern towns have their own history. They have their origins, mode of dressing, language, festival and other ways of life. While the modern towns are settlement of people in recent time.\nAncient Towns in Nigeria\nAncient towns are towns that have been in existence for a long-time. There are some towns that have been in existence in the distant past in Nigeria. Some of them include: Ile-Ife, Aba, Benin, Bonny, Calabar, Daura, Gobir etc.\nA.) Benin: Benin is one of the ancient cities in Nigeria. It is the present capital of Edo state. It was known as the Benin Empire or kingdom in the past. The kingdom has a historical",
  "bst": "Animals\nAnimals are living things. They occupy the environment with us. Some animals are domestic while some animals are also friendly to us while some are dangerous to us.\nAnimals in the school Compound\n1. Snail\n2. frog\n3. Butterfly\n4. Grasshopper\n5. Lizard\n6. Wall gecko\nImportant features of some Animals\n1. Snail (shell)\n2. Lizard (scales and tail)\n3. Toad (webbed hind limbs)\n4. cock (feather, wings)\n\nSome Common Animals in their Group\nMammals: These are animals that give birth. e.g human being, dog, Goat, rabbit, cat, Cow etc\nReptiles: e.g Snake, Lizard, Crocodile\nBirds: Hen, pigeon, Duck\nInsects: Ant, Cockroach, butterfly\nAmphibians: toad, frog.\n\nWeek 4\nBehaviour of Animals\nBehaviour of animals is what they do. these can include their habits.\nSome common animals and their habits\n1. Dog: Eats meat and bones. Walks and runs. lives on land. Dog barks. They give birth to young ones (puppies).\n2. Chicken: feeds on seeds and grains. lives on land, walks, runs and flies. Lay eggs. Hen crows.\n3. Sheep: Eats leaves and grasses. Lives on land. Walks and runs. Gives birth to young ones (lambs). sheep bleats.\n4. Cockroaches: Eats plants and animals. Lives in the dark corners of homes. Cockroaches crawl. lays eggs that grow into young ones. Destroys clothes, books etc.\n\nWhere Animals live\nDomestic animals are kept in special places. Cows, goats and sheep are kept in a pen.\nCocks, hens and chickens are kept in a coop.\nFish are kept in an aquarium/pond.\nRabbits are kept in a hutch.\nBirds are kept in a cage.\nHorses are kept in a stable.\nDogs and cats can live in the house.\nExercises\nWhich animal has feathers?\nWhich one has a shell?\nWhich ones have webbed hind limbs?\nWhich ones lay eggs?\nWhich ones lives on both land and water?\n\nMeaning of clay\nClay is an earthly material which can be moulded when wet.\nPreparation of clay for Moulding\nThe preparation of clay involves three processes.\n1. Collection of clay\n2. collection of pounding tools\n3. pounding the clay into sticky form\n\nForms of Energy\nEnergy is the ability to do work.\nEnergy exists in many forms, which are:\n1. Light energy\n2. Sound energy\n3. heat energy\n4. Wind energy\n5. Chemical energy\nKinds of Energy\nThere are two basic kinds of energy:\n1. potential energy: This is energy at rest.\n2. kinetic energy: This is a moving energy.\n\nSound Energy\nSound energy is something we can hear. Both living and non-living things produce sound. A thing can be known or identified through the sound it produces. When a sound is not pleasant, it is called noise.\nWe use our ears to receive sounds. We can produce sound by clapping, hitting an object, blowing a flute.\n\nMusical Instruments\nMusical instruments are those things that produces musical sound. They are sound energy.\nExamples of local musical instruments\nWooden drum\nGong\nflute from cow horn\nSticks\nMaracas\nGoge\nModern Musical Instrument\nGuitar\nTrumpet\nkeyboard\nSaxophone\nViolin\nModern drums.",
  "nv": "Foods we eat in our Culture as family members\nFood is something solid or liquid that we eat to grow, remain alive and healthy. In Nigeria, we eat different types of food. Some of the food we eat are: yam, cassava, Amala, rice, tuwo shinkafa, Beans, Maize etc.\nBenefits of eating together as a family\n1. Eating together makes members of the family happy.\n2. It brings unity and loyalty to the family.\n3. It promotes the sense of sharing in the family.\n4. It creates love among the family members.\n5. It teaches children table manners.\n\nImportance of food to our Growth\nThe Nutrients in the foods we take are the following:\n1. Carbohydrate e.g Yam, bread, rice etc.\n2. Protein e.g. Meat, fish, egg, beans etc.\n3. Vitamins e.g fruits and vegetables.\n4. Fats and Oil e.g butter, cheese etc.\nImportance of food\n1. food supply energy needed to do work.\n2. They build our body.\n3. They keep the body healthy.\n4. They provide heat and energy.\n5. They also makes people remain alive.\n\nGreeting and Respect to Elders in our Culture\nGreeting is a way of showing respect to people and appreciating them. There are different forms of greetings. Some of them are: kneeling, prostrating, shake of hands etc.\nImportance of greeting\n1. Greeting promotes tolerance.\n2. It promotes good neighbourliness.\n3. It promotes Courtesy.\n4. It shows appreciation.\n5. It promotes friendliness.\n6. It is a sign of respect to elders.\nActivities\nExplain the meaning of greetings.\nList different ways of greetings.\nMention reasons why we need to greet one another.\n\nWays of keeping our Environment Clean\nOur environment is our surroundings. We must keep our homes, streets and schools clean at all this times.\n1. We must sweep the floor of the rooms everyday.\n2. We must wash the toilet with disinfectant and make it clean.\n3. We must clean the furniture, windows and doors to remove the stains.\n4. Wash plate and pots.\n5. We must cut the bushes around our homes and school.\n6. We must provide drains or refuse bins in homes and schools.\n\nTools needed to carry out different cleaning Activities\n1. Broom: this is used to sweep floor and remove cobwebs\n2. Bucket: This is used to store water for use during cleaning.\n3. Cutlass: This is used to cut grasses in the surrounding.\n4. Rake: this is used to clear refuse in gutters.\n5. Waste bin: This is a container in which waste and refuse are stored for disposal.\n6. Water and soap: These are used to clean floors and surfaces and to wash our hands after cleaning.\n\nMeaning of an Accident\nAn accident is an unplanned event causing damage or injury.\nCauses of Accidents\n1. Throwing objects in the classroom.\n2. Water on the floor can make someone to slip and fall down.\n3. Banana peels left on the floor can make a pupil who step on them to slip and fall down.\n4. A pupil who sits on a damaged chair can fall down.\n5. Playing with sharp objects.\n6. Running carelessly.\n7. Exposed electrical wire can cause electric shock.\nWhat to do when an Accident occurs\n1. report immediately to a teacher in the school.\n2. Apply first Aid.\n\nMeaning of Drugs\nA drug is a substance use as medicine to cure sickness.\nTypes of drugs\na. Legal drugs: These are drugs that are approved by government for people to use. Examples are: paracetamol, Vitamin C, codeine, panadol etc.\nb. Illegal drugs: These are drugs that are not approved for people to use. Examples are: Cocaine, heroin etc.\nc. Socially acceptable drugs: These are drugs which are by culture. But they are harmful. Examples are alcohol, cigarette.\n\nWEEK 9\nThe Security Agencies\nExamples of security agents are:\n1. police\n2. Federal Road Safety Commission (FRSC)\n3. National Drug law Enforcement Agency (NDLEA)\n4. State Security Service (SSS)\n5. Nigeria Security and Civil Defence Commission (NSCDC)\n6. The Nigerian Army\n7. Nigeria prisons service\n8. National Agency for food and Drug Administration and Control (NAFDAC) etc.",
  "rs": "Jesus Teaching on How to pray\nJesus taught us some ways to pray. Some of them are stated below:\n1. We pray to God always. This means we pray without ceasing.\n2. We should not pray because we want people to hear what we are praying about.\n3. Pray without getting discouraged. If we pray to God and the answer has not come we should keep praying.\n4. pray in faith without doubt. We should have belief that God we hear us.\n5. pray for something specific. Pray for what you want God to do for you.\nHomework\nWrite the Lords prayer\n\nJesus' power over Natural forces\nJesus is the son of God. He has power over all things on earth. He has power over natural forces. Jesus demonstrate His power by:\n1. Calming the sea: There was a great storm which almost sank the ship but Jesus spoke to the wind and said \"peace be still\" and the wind stopped immediately.\n2. Walking on the sea: Jesus walked on the sea.\n\nFeeding of the five thousand people\nWhen Jesus went to the mountain with His disciples, about five thousand people followed them. When Jesus saw that the people might be hungry, He called one of his disciples and asked him how they could get bread to feed them.\nHe was told that a boy had five loaves of bread and two small fishes. He prayed and gave them to his Disciples to give to the people. They all ate and were satisfied. They had 12 full baskets of leftovers.\npeople whom Jesus healed\n1. peter's Mother-in-Law\n2. The paralysed Man\npeople whom Jesus Raised from the Dead\n1. Jairus's Daughter\n2. The widow's son\n3. Raising of Lazarus\nMemory Verse (Luke 7:16)\nA great prophet is risen up among us; and that God has visited his people.\n\nJesus' power over Diseases and Death\nJesus performed a lot of miracles on earth. He helped so many people with his power. He healed the sick and raised the dead.\nPeople whom Jesus Healed\n1. Peter's Mother-in-law\n2. the paralysed Man\nPeople whom Jesus Raised from the Dead\n1. Jairus' Daughter\n2. The widow's son\n3. Lazarus\nMemory verse Luke 7:16\nA great prophet is risen up among us; and that God has visited his people.\n\nJesus' power over Evil people\nJesus' went to Nazareth where he was brought up. He entered the synagogue on the sabbath day and stood up to read the scripture. He was given the book of Isaiah and he preached the word unto them in the synagogue. They were about to push him down from the hill but he escaped through their midst.\nWays to identify Bad friends\n1. They steal what does not belong to them.\n2. They kidnap human beings for ritual.\n3. They plan evil against others.\n4. They always fight others.",
  "phe": "Rest\nRest is the period that a person is not doing anything. When the body works for a long period of time it needs rest so as to relax the muscles. Too must work for a long period of time harms the body.\nImportance of resting\n1. It helps both children and adolescent to grow.\n2. It refreshes the mind and the body organs.\n3. Rest help us to concentrate better at school or work.\n4. Rest helps the brain and the heart to function well.\n\nWeek 3\nSleeping\nSleeping is when a person lies down with his eyes closed while the mind and body are inactive.\nBest conditions for sleeping\n1. people should sleep in a comfortable room.\n2. people should sleep in a well ventilated room.\n3. The beddings should be clean and comfortable.\n4. Avoid overcrowding of people on the same bed.\n5. Avoid overcrowding of people in the same room.\n\nFirst Aid\nFirst aid is the first assistance given to an injured or sick person before the arrival of a medical doctor. The purpose of first aid is to ease the victim's pains and to prevent his or her condition from getting worse.\n\nConditions that require First Aid\nSome of the conditions which require first aid are:\na. Severe bleeding: Bleeding occurs when blood flows out of the blood vessels. Bleeding can be internal or external.\nSteps in stopping bleeding\n1. Calm the patient and let him lie down flat on the floor or bed.\n2. Make the patient not be to have fear.\n3. Loose the clothes around the victim's neck and waist to allow easy breathing.\n4. Raise the bleeding part of the body to reduce the flow of blood to the affected area.\n5. Raise the foot of the bed to allow more blood to flow to the brain so as to prevent fainting.\n\nFainting\nThis is a temporary loss of consciousness. A person who has fainted may lose touch with things happening within and around him. Fainting may occur as a result of insufficient supply of air or blood to the brain.\nWays of to help a fainted person\n1. Stop bleeding if there is any.\n2. Give the victim mouth-to-mouth respiration.\n3. Give the victim fresh air.\n4. If the victim is wearing tight articles such as a belt, tie and wrist watch loosen them.\n\nBruises\nBruises occur as a result of an accident. It is a common skin injury which occur when the body is brushed against a hard object.\nBruises can be handled by massaging the affected part with an ice block.\nThe affected part can also be cleaned with clean water and disinfectant.\n\nExhaustion\nExhaustion is a condition where the body is overworked beyond physical and mental tolerance. it is when you have overworked your body.\nWays to care for victims of Exhaustion\n1. Allow the person to rest and sleep.\n2. Remove tight clothes.\n3. The victim should be kept in a place where there is enough air.\n\nSafety Education\nSafety is the freedom from danger or accident.\nSafety education is a programme of safety and accident prevention against all types of risks.\nSafety rules\n1. Warm up before before starting sport.\n2. The play ground should be free from dangerous objects like broken bottle.\n3. Do not play on a slippery ground.\n4. There should be no potholes in the play ground.\nExercises\n1. Explain the meaning of safety\n2. What is Safety education?\n3. List some safety rules.",
  "e": "Week 4 Monday 20 May 202...\nGrammar\nDeterminers\nfew, some, many, much and any are also called determiners.\nRead the story in your (Grammar textbook)\nWrite the nouns that they describe in the box below.\nDeterminers | Nouns\n1. few |\n2. some |\n3. Many |\n4. Much |\n5. any |\n\nAdjectives\nAdjective are words that describe or talk about a Noun.\nExamples of Adjective\n1. greedy\n2. beautiful\n3. Ugly\n4. Success\n5. power\n6. dirt\n7. rich\n8. poor\n9. slow\n10. pain\nClasswork\nMake five sentences using Adjectives.\n\nWEEK 6\nGrammar\nAdverbs\nAdverbs are words that tell you more about verbs or words for actions. Many adverbs end in-ly.\nThere are different types of adverbs which are: Adverb of manner which tell you 'how' actions happen.\nAdverb of time which tell you 'when' actions happen.\nAdverbs of place which tell you 'where' actions happens.\nThe old lady walked slowly.\nAll the guests arrived late for the party.\nPort Harcourt is a garden city, every where there are trees and flowers.\nClasswork\nGrammar practice workbook page 54 & 55\nHomework\npage 56 & 57\n\nPreposition\nA preposition is a word that tells you where or when something is in relation to something else. Prepositions are usually has a noun or pronoun after it. Some preposition are used to show time or when something happens.\nExamples of prepositions are: in, from, at, for, of, above, between, over, across, under, inside, next to, at, before, after, on.\n\nWEEK 8\nGrammar\nThe Verb (be)\nThe words 'is' and 'are' are forms of the verb be.\nYou use 'is' or 'isn't' with singular nouns.\nYou use 'are' or 'aren't' with plural nouns.\nClasswork\npage 62\nHomework\npage 63",
  "m": "Mathematics\nTime\n(Drawing of a clock showing 3 o'clock)\nThe clock face shows 12-hour clock times. The long hand on the clock face is called minute hand. It tells the number of minutes past or to the hour. The short hand on the clock face is called the hour hand.\n(Drawing of a clock showing 4 o'clock)\n4 o'clock\n(Drawing of a clock showing 8 o'clock)\n8 o'clock\nClasswork\nWrite the following time\n(Drawing of a clock showing 1 o'clock)\n(Drawing of a clock showing 6 o'clock)\n3 (Drawing of a clock showing 11 o'clock)\n4 (Drawing of a clock showing 7 o'clock)\n5 (Drawing of a clock showing 5 o'clock)\nHomework\nWrite the following time\n1 (Drawing of a clock showing 9 o'clock)\n2 (Drawing of a clock showing 12:30)\n3 (Drawing of a clock showing 12 o'clock)\n4 (Drawing of a clock showing 2 o'clock)\n5 (Drawing of a clock showing 10 o'clock)\n\nMath\nAnalogue and digital time\n(Drawing of an analogue clock showing 5:00 and a digital representation)\nAnalogue time: 5 o'clock\nDigital time: 5:00\n(Drawing of an analogue clock showing 5:30)\nAnalogue time: half past 5\nDigital time: 5:30"
}