[
  {
    "subject": "National Values",
    "content": "### Week 1 & 2\n\n#### National Values\n\n**Reasons for taking substances into the body**\n\nPeople take substance into their body for the following reasons:\n1. Drugs keep people alive.\n2. Food and other substances keep hunger away.\n3. People take soft drinks for enjoyment.\n4. Some people take substances because they see others taking them.\n5. Some people take some substances out of curiosity. They want to know what the substances taste like.\n\n***\n\n### National Values (Week 3)\n\n**Overdose**\n\nOverdose means to take too much food or drink. It is a bad habit that a good pupil must avoid always.\n\n**Signs of Overdose**\n1. Stooling\n2. Vomiting\n3. Fainting\n4. Sleeplessness\n5. Stomach-pain\n\n**Effect of taking too much food, drink and smoke**\n\n1. When a person drinks too much, he urinates frequently.\n2. A child who drinks too much water before going to bed usually bed-wets.\n3. An adult who drinks too much alcohol becomes drunk.\n4. Too much smoke can make someone faint.\n\n***\n\n### Week 4 (Tuesday 26 May 2015)\n\n#### National Values\n\n**Ways of helping somebody who takes overdose**\n\nA person who is suffering from too much food, drink or smoke should be taken to the hospital immediately. When a person faints, apply first aid to bring him back to life.\nReport a child who smokes or drinks alcohol to the teacher and the parents.\n\n**Activities**\n1. What are the effects of drinking too much?\n2. What happens to a person who inhales too much smoke?\n3. How can you help people who suffer from the effects of too much eating, drinking and inhaling smoke?\n\n***\n\n#### National Values\n\n**Food**\n\nFood is what we eat to grow, stay alive, have energy. Examples of food items: bread, eggs, yam, garri, rice, beans, millet, mango, carrot, fish, meat, banana and orange.\n\n**Where we get food in the community**\nWe get our food from the farm.\nWe buy some food items in the market.\nWe get meat from cows, goats, sheep, hens and other animals.\nW..."
  },
  {
    "subject": "English Language",
    "content": "### Composition\n\n**My Mother**\n\nThe name of my mother is Mrs Sandi Seriki. She is 38 years old. She is short and fat. My mother is black in complexion. Her face is round. She has black hair.\n\n**Homework**\n\nWrite a composition about your mother.\n\n***\n\n**A Hospital**\n\nA hospital is a place where sick people are treated. Sick people in the hospital are called patients. Doctors and nurses take care of sick people in the hospital.\n\n***\n\n### Grammar\n\n**Capital letters**\n\nWe use capital letters to begin people's names. We also begin the days and month with capital letters.\n\nAfiong, Nosa, Monday, Tuesday, May, December.\n1. Afiong was born in April.\n2. He comes here on Fridays.\n3. Nosa was not in school on Tuesday.\n4. August is the eight month of the year.\n5. My best day in the week is Wednesday.\n\n**Classwork**\n\nUse capital letters to make these sentences correct.\n1. ada is in a beautiful dress.\n2. Musa and Isa always read their books.\n3. Our teacher's name is mrs ekpe.\n4. School begins on monday.\n\n***\n\n### Grammar\n\n**Pronouns**\n\nPronouns are words we use instead of a noun.\n\n**Examples of pronouns**\n- she\n- I\n- They\n- Him\n- we\n- He\n- It\n- Her\n- them\n- me\n\n**Examples:**\n- Tola is a boy. -> He is a boy.\n- Ngozi is a girl. -> She is a girl.\n- This watch is very fine. -> It is very fine.\n\n**Classwork (Change the nouns to pronoun)**\n1. Adams is a nice boy.\n2. Mary can sing well.\n3. The cat walks slowly.\n4. Odiete and Anum are pupils.\n5. Musa is an intelligent boy.\n\n**Homework**\n\nChange the underline nouns to pronoun.\n1. My <u>father</u> bought a shirt from the market.\n2. <u>Mariam</u> has a beautiful voice.\n3. <u>John</u> is brilliant.\n4. The <u>dog</u> barks harshly.\n5. <u>Eva</u> sings like an angel.\n\n***\n\n### Week 5\n\n#### Grammar\n\n**Present Continuous tense**\n\nPresent continuous tense is used for actions or events happening now.\n\ne.g. You are learning English now.\nI am standing a..."
  },
  {
    "subject": "Basic Science and Technology",
    "content": "### Basic Science\n\n**Simple Machines**\n\nA Machine is a device that makes work faster and easier.\n\n**Examples of Simple Machines**\n1. Spoon\n2. Bottle Opener\n3. Broom\n4. Hammer\n5. Cutlass\n6. Pliers\n7. forks\n8. Sickle\n9. Windlass\n10. Wheel barrow\n\n***\n\n### Week 3\n\n#### Basic Science\n\n**Advantages of using simple machine**\n1. It makes work fast.\n2. It makes work easy.\n3. It saves time.\n4. It saves energy.\n5. It helps us to do more work.\n\n***\n\n### Basic Science\n\n**Safe use of Simple Machines**\n\n- Use a knife carefully.\n- Do not use a knife carelessly.\n- Hold the knife the correct way.\n- Give a pair of scissors to someone carefully.\n\n***\n\n### Basic Science\n\n**Materials for making simple Machines**\n\nMachines are made of different materials. These materials include:\n1. Steel\n2. Wood\n3. Plastic\n4. Rope\n5. rubber\n\n**Examples of machines and the materials used in making them are:**\n\n| Machine | Materials |\n|---|---|\n| scissors | metal and plastic |\n| broom | Raffia |\n| Catapult | Wood and rubber |\n\n***\n\n### Basic Science\n\n**Meaning of Energy**\n\nEnergy is the ability to do work. We need energy to wash our clothes, work on the farm, carry load, cook our food, walk and bathe.\n\n***\n\n### Basic Science\n\n**Things that use Energy**\n\nThe following are the things that use energy:\n1. Stove\n2. heater\n3. torch\n4. fridge\n5. bulb\n6. television\n7. fan\n\n***\n\n### Basic Science\n\n**Uses of Energy**\n1. Energy is used to do different things.\n2. Energy is used for washing our clothes.\n3. for lifting heavy objects.\n4. for fetching water from the well.\n5. for doing our work.\n\n**Questions**\n- State the meaning of energy.\n- Name four items that make use of energy."
  },
  {
    "subject": "Computer",
    "content": "### Computer Science\n\n**Common Information Technology (IT Devices)**\n\nIT devices are used to pass information from one person to another and from one place to another.\n\n**Examples of Common Information Technology Devices**\n1. Calculator\n2. Radio\n3. Wrist Watch\n4. Television\n5. The Computer System\n6. A mobile phone\n7. A digital camera\n\n***\n\n### Computer Science\n\n**Description of common Information Technology (IT) Devices**\n\n**Television:** A television allows us to watch cartoons and news. It has buttons for changing channels and the volume.\n\n\n*A Television*\n\n***\n\n### Week 4 (Tuesday 26 May 2015)\n\n#### Computer Science\n\n**Common IT Device: Radio**\n\n**Radio:** A radio passes audio sound programmes and messages to the public. It has an antenna for receiving sound messages and a knob for turning to different stations. It also has a speaker through which sound is passed.\n\n***\n\n### Computer Science\n\n**Calculator:** A calculator performs addition and subtraction of numbers. It has a small screen where you see numbers which have been pressed from the keypad.\n\n***\n\n### Computer Science\n\n**IT Device: Computer**\n\n**Computer:** A computer is an electronic device that processes data and gives information. It has a monitor where you see what has been entered from the keyboard and a system unit that connects all other devices.\n\n***\n\n### WEEK 7\n\n#### Computer Science\n\n**IT Device: Digital Wristwatch**\n\nDigital wristwatch is worn on a stripe around the wrist. A watch displays the time in numbers. It has the hour, the minute and the second.\n\n***\n\n### Computer Science\n\n**Mobile GSM phone**\n\nA mobile phone is a small radio telephone that is used to communicate among people at long distances. It has a small screen and a number of keys to dial phone numbers."
  },
  {
    "subject": "History",
    "content": "### History\n\n**Heroes and Heroines in our Community**\n\n**Professor Wole Soyinka.** He is the first African who won Nobel prize for literature in 1986. Soyinka was born into a Yoruba family in Abeokuta on 13 July, 1934. He is regarded as one of the best poets, play writs and essay writer who have been imprisoned for many years. He also played active roles in Nigeria's political history and its struggle with British Colonization.\n\n***\n\n### History\n\n**Chief Anthony Enahoro**\n\nHe was born on 22 July 1923. Chief Anthony Enahoro was one of Nigeria's leading anti-colonial and pro-democracy activist. He had a long experience in publishing, politics and pro-democracy movements. Chief Anthony Enahoro became the first Nigerian to move the motion for Nigeria's independence which was eventually granted in 1960.\n\n***\n\n### History\n\n**History of Alhaja Kudirat Abiola**\n\nAlhaja Kudirat Abiola was the wife of late Chief MKO Abiola. Her husband won the presidential election held on June 12, 1993. She stood by her husband. She was killed in 1996 while her husband was in prison. She wanted Nigeria to be free from military rule. She fought for government of the people, by the people and for the people.\n\n***\n\n### History\n\n**Traditional Rulers**\n\nA traditional ruler is a cultural leader who protects the traditions and culture of his people. A traditional ruler is the head of an ethnic unit or clan whose title is recognised by government of the state.\n\n**Titles of traditional rulers**\n- Emir, Lamido, Shehu (Hausa land)\n- Oba (Yoruba land)\n- Eze, Igwe and Obi (Igbo land)\n\n***\n\n### History\n\n**Roles of Traditional Rulers**\n1. Custodian of culture and other domains.\n2. They settle land and marriage quarrels.\n3. They support good leaders.\n4. They educate the people to do their civic duties like voting, pay tax.\n5. They punish bad behaviour.\n6. They make people to obey law and order in the community.\n\n***\n\n### History\n\n**Traditional Title..."
  },
  {
    "subject": "Religious Studies",
    "content": "### Jesus' Teaching on How to pray\n\nJesus taught us some ways to pray. some of them are stated below.\n1. **pray without ceasing:** This means we pray to God always.\n2. **pray to God in secret:** We should not pray because we want people to hear what we are praying about.\n3. **Pray without getting discouraged:** If we pray to God and the answer has not come we should keep praying.\n4. **pray in faith without doubt:** We should have belief that God will hear us whenever we pray.\n5. **pray for something specific:** pray for what you want God to do for you.\n\n**Homework**\nWrite the Lord's prayer\n\n---\n\n### Jesus' power over Natural forces\n\nJesus is the son of God. He has power over all things on earth. He has power over natural forces. Jesus demonstrated his power by:\n1. **Calming the sea:** There was a great storm which almost sank the ship. But Jesus spoke to the wind and said 'Peace be still' and the wind stopped immediately.\n2. **Walking on the sea:** Jesus walked on the sea.\n\n---\n\n### Feeding of the five Thousand people\n\nWhen Jesus went to the mountain with his disciples, about five thousand people followed them. When Jesus saw that the people might be hungry, He called one of his disciples and asked him how they could get bread to feed them.\nHe was told that a boy had five loaves of bread and two small fishes. He prayed and gave them to his disciples to give to the people. They all ate and were satisfied. They had 12 full baskets of leftovers.\n\n**People whom Jesus healed**\n1. Peter's Mother-in-law\n2. The paralysed man\n\n**People whom Jesus raised from the dead**\n1. Jairus's Daughter\n2. The widow's son\n3. Raising of Lazarus\n\n---\n\n**Memory Verse (Luke 7:16)**\nA great prophet is risen up among us; and that God has visited his people.\n\n---\n\n### Jesus' power over Diseases and Death\n\nJesus performed a lot of miracles on earth. He helped so many people with his power. He healed the sick and raised the dead.\n\n**People wh..."
  },
  {
    "subject": "Physical and Health Education",
    "content": "### Rest\n\nRest is the period that a person is not doing anything. When the body works for a long period of time it needs rest so as to relax the muscles. Too much work for a long period of time harms the body.\n\n**Importance of resting**\n1. It helps both children and adolescent to grow.\n2. It refreshes the mind and the body organs.\n3. Rest help us to concentrate better at school or work.\n4. Rest helps the brain and the heart to function well.\n\n---\n\n### Week 3\n\n**Sleeping**\n\nSleeping is when a person lies down with his eyes closed while the mind and body are inactive.\n\n**Best conditions for sleeping**\n1. people should sleep in a comfortable room.\n2. people should sleep in a well ventilated room.\n3. The beddings should be clean and comfortable.\n4. Avoid overcrowding of people on the same bed.\n5. Avoid overcrowding of people in the same room.\n\n---\n\n### First Aid\n\nFirst aid is the first assistance given to an injured or sick person before the arrival of a medical doctor. The purpose of first aid is to ease the victim's pains and to prevent his or her condition from getting worse.\n\n---\n\n### Conditions that require First Aid\n\nSome of the conditions which require first aid are:\na. **Severe bleeding:** Bleeding occurs when blood flows out of the blood vessels. Bleeding can be internal or external.\n\n**Steps in stopping bleeding**\n1. Calm the patient and let him lie down flat on the floor or bed.\n2. Make the patient not be to have fear.\n3. Loose the clothes around the victim's neck and waist to allow easy breathing.\n4. Raise the bleeding part of the body to reduce the flow of blood to the affected area.\n5. Raise the foot of the bed to allow more blood to flow to the brain so as to prevent fainting.\n\n---\n\n### Fainting\n\nThis is a temporary loss of consciousness. A person who has fainted may lose touch with things happening within and around him. Fainting may occur as a result of insufficient supply of air or blood to the..."
  },
  {
    "subject": "English Language",
    "content": "### Week 4 - Grammar\n\n**Determiners**\n\nfew, some, many, much and any are also called determiners.\nRead the story in your Grammar textbook\nWrite the nouns that they describe in the box below.\n\n| Determiners | Nouns |\n|---|---|\n| 1. few | |\n| 2. some | |\n| 3. many | |\n| 4. much | |\n| 5. any | |\n\n---\n\n### Adjectives\n\nAdjective are words that describe or talk about a Noun.\n\n**Examples of Adjective**\n1. greedy\n2. beautiful\n3. ugly\n4. success\n5. power\n6. dirt\n7. rich\n8. poor\n9. slow\n10. pain\n\n**Classwork**\nMake five sentences using Adjectives\n\n---\n\n### Week 6 - Grammar\n\n**Adverbs**\n\nAdverbs are words that tell you more about verbs or words for actions. Many adverbs end in -ly. There are different types of adverbs which are: Adverb of manner which tell you 'how' actions happen. Adverb of time which tell you 'when' actions happen. Adverbs of place which tell you 'where' actions happen.\n- The old lady walked slowly.\n- All the guests arrived late for the party.\n- Port Harcourt is a garden city, everywhere there are trees and flowers.\n\n**Classwork**\nGrammar practice workbook page 54 & 55\n\n**Homework**\npage 56 & 57\n\n---\n\n### Preposition\n\nA preposition is a word that tells you where or when something is in relation to something else. Prepositions are usually has a noun or pronoun after it. Some preposition are used to show time or when something happens.\nExamples of prepositions are: in, from, at, for, of, above, between, over, across, under, inside, next to, at, before, after, on.\n\n---\n\n### WEEK 8 - Grammar\n\n**The Verb (be)**\n\nThe words 'is' and 'are' are forms of the verb be.\nYou use 'is' or 'isn't' with singular nouns.\nYou use 'are' or 'aren't' with plural nouns.\n\n**Classwork**\npage 62\n\n**Homework**\npage 63"
  },
  {
    "subject": "Math",
    "content": "### Mathematics\n\n**Time**\n*(Image of a clock face)*\n\nThe clock face shows 12-hour clock times. The long hand on the clock face is called minute hand. It tells the number of minutes past or to the hour. The short hand on the clock face is called the hour hand.\n\n*(Images of clocks showing 4 o'clock and 8 o'clock)*\n- 4 o'clock\n- 8 o'clock\n\n**Classwork**\nWrite the following time\n*(Images of clocks for classwork)*\n\n**Homework**\nWrite the following time\n*(Images of clocks for homework)*\n\n---\n\n### Math\n\n**Analogue and digital time**\n\n*(Image of a clock at 5:00)*\n- Analogue time: 5 o'clock\n- Digital time: 5:00\n\n*(Image of a clock at 5:30)*\n- Analogue time: half past 5\n- Digital time: 5:30"
  }
]