{
  "pvs": "### Week 1 & 2\n\n**FOOD**\n\nFood is what we eat. It may be in liquid or solid form. Food makes us grow and remain healthy.\n\n**Types of food**\na. **Energy giving food:** These are food that gives us energy. Carbohydrate e.g yam, maize, cassava etc.\nb. **Body-Building food:** These are food which supply us energy protein into our body. e.g beans, eggs, fish, meat etc.\nc. **Fatty food:** These are food that provide fat and oil that help to repair damage cells in the body. e.g butter, vegetable oil, palm oil, groundnut oil, Cheese etc.\nd. **protective food:** these are food that protect the body against diseases e.g fruits and vegetable.\n\n---\n\n**Balanced diet**\n\nA Balanced diet is the diet that contains all the classes of food. This means that the right amount of Carbohydrate, protein, vitamins and minerals must be present in the food we eat.\n\n**Examples of Balanced diet**\n1. Moinmoin with vegetable, fish served with pap or bread and juice drink.\n2. Rice and Beans served with boiled egg, fish or meat, stew and fruit juice.\n3. Boiled or fried egg served with bread and fruit juice.\n4. pounded yam served with vegetable and melon soup, fish, meat and juice drink.\n5. Balanced diet makes our bones and teeth strong.\n6. Balanced diet gives us energy and strength.\n\n---\n\n**Bathing**\n\nBathing is an act of washing our body with clean water, soap and sponge.\n\n**When to take our bath**\na. When we wake up in the morning.\nb. Before going to bed at night.\nc. After exercises.\nd. After working.\n\n**Materials used to wash our body**\n1. toilet soap\n2. sponge\n3. clean water\n4. bucket\n\n**Reasons why we bath regularly**\n1. We bath to be clean, neat and smell nice.\n2. To be free from body odour.\n3. Bat...",
  "h": "### Heroes and Heroines in our community\n\nProfessor Wole Soyinka. He is the first African to be awarded Nobel prize in literature in 1986.\nSoyinka was born into a Yoruba family in Abeokuta on 13 July 1934.\nHe is regarded as one of the best poets, play wrights and essay writers who have been imprisoned for many times for criticizing Nigeria government. He also played active roles in Nigeria's political history and its struggle with British Colonization.\n\n---\n\n### History of the state\n\nWe have 36 states and the federal capital Territory in Nigeria. Each state has its own people and government. States are created for easy administration and to bring government closer to the people so that they can enjoy the benefits of the government.\n\n| | State | Capital | Year of Creation |\n|---|---|---|---|\n| 1 | Abia | Umuahia | 27, August 1991 |\n| 2 | Adamawa | Yola | 27, August 1991 |\n| 3 | Akwa Ibom | Uyo | 23, Sept. 1987 |\n| 4 | Anambra | Awka | 27, August, 1991 |\n| 5 | Bauchi | Bauchi | 3, February, 1976 |\n| 6 | Bayelsa | Yenegoa | 1, October, 1996 |\n| 7 | Benue | Makurdi | 3, February, 1976 |\n| 8 | Borno | Maiduguri | 3, February, 1976 |\n| 9 | Cross River | Calabar | 27, May 1967 |\n| 10 | Delta | Asaba | 27, August 1991 |\n| 11 | Ebonyi | Abakaliki | 1, October 1996 |\n| 12 | Edo | Benin | 27, August 1991 |\n| 13 | Ekiti | Ado-Ekiti | 1, October 1996 |\n| 14 | Enugu | Enugu | 27, August 1991 |\n| 15 | Gombe | Gombe | 1, October 1996 |\n| 16 | Imo | Owerri | 3, February 1976 |\n| 17 | Jigawa | Dutse | 27, August 1991 |\n| 18 | Kaduna | Kaduna | 27, May 1967 |\n| 19 | Kano | Kano | 27, May 1967 |\n| 20 | Katsina | Katsina | 27, May 1967 |\n| 21 | Kebbi | Bini-Kebbi | 27, August 1991 |\n| 22 | Kogi | Lokoja | 27, August 1991 |\n| 23 | Kwara | Ilorin | 27, May 1967 |\n| 24 | Lagos | Ikeja | 27, May, 1967 |\n| 25 | Nasarawa | Lafia | 1, October 1996 |\n| 26 | Niger | Minna | 3, February 1976 |\n| 27 | Ogun | Abeokuta | 3, February, 1976 |\n| 28 | Ond...",
  "bst": "### Animals\n\nAnimals are living things. They occupy the environment with us. Some animals are domestic while some animals are also friendly to us while some are dangerous to us.\n\n---\n\n**Animals in the school Compound**\n1. Snail\n2. frog\n3. Butterfly\n4. Grasshopper\n5. Lizard\n6. Wall gecko\n\n**Important features of some Animals**\n1. Snail (shell)\n2. Lizard (scales and tail)\n3. Toad (webbed hind limbs)\n4. Cock (feather, wings)\n\n---\n\n**Some common Animals in their group**\n- **Mammals:** These are animals that give birth. e.g human being, dog, goat, rabbit, cat, cow etc.\n- **Reptiles:** e.g snake, lizard, crocodile\n- **Birds:** Hen, pigeon, duck\n- **Insects:** Ant, cockroach, butterfly\n- **Amphibians:** toad, frog.\n\n---\n\n### Week 4\n\n**Behaviour of Animals**\n\nBehaviour of animals is what they do. these can include their habits. Some common animals and their habits\n1. **Dog:** Eats meat and bones. Walks and runs. lives on land. Dog barks. They give birth to young ones (Puppies).\n2. **Chicken:** feeds on seeds and grains. lives on land, walks, runs and flies. Lay eggs. Hen crows.\n3. **Sheep:** Eats leaves and grasses. Lives on land. Walks and runs. Gives birth to young ones (lambs). sheep bleats.\n4. **Cockroaches:** Eats plants and animals. Lives in the dark corners of homes. Cockroaches crawl. lays eggs that grow into young ones. Destroys clothes, books etc.\n\n---\n\n**Where Animals live**\n\nDomestic animals are kept in special places. Cows, goats and sheep are kept in a pen.\nCocks, hens and chickens are kept in a coop.\nFish are kept in an aquarium/pond.\nRabbits are kept in a hutch.\nBirds are kept in a cage.\nHorses are kept in a stable.\nDogs and cats can live in the house.\n\n**Exercises**\n- Which animal has feathers?\n- Which one has a shell?\n- Which ones have webbed hind limbs?\n- Which ones lay eggs?\n- Which ones lives on both land and water?\n\n---\n\n**Meaning of clay**\n\nclay is an earthly material which can ...",
  "nv": "### Foods we eat in our Culture as family members\n\nFood is something solid or liquid that we eat to grow, remain alive and healthy. In Nigeria, we eat different types of food. Some of the food we eat are: yam, cassava, Amala, rice, tuwo shinkafa, Beans, Maize etc.\n\n**Benefits of eating together as a family**\n1. Eating together makes members of the family happy.\n2. It brings unity and loyalty to the family.\n3. It promotes the sense of sharing in the family.\n4. It creates love among of the family members.\n5. It teaches children table manners.\n\n---\n\n### Importance of food to our Growth\n\nThe Nutrients in the foods we take are the following:\n1. **Carbohydrate** e.g. Yam, bread, rice etc.\n2. **Protein** e.g. Meat, fish, egg, beans etc.\n3. **Vitamins** e.g fruits and vegetables.\n4. **Fats and Oil** e.g. butter, cheese etc.\n\n**Importance of food**\n1. food supply energy needed to do work.\n2. They build our body.\n3. They keep the body healthy.\n4. They provide heat and energy.\n5. They also makes people remain alive.\n\n---\n\n### Greeting and Respect to Elders in our Culture\n\nGreeting is a way of showing respect to people and appreciating them. There are different forms of greetings. Some of them are: kneeling, prostrating, shaking of hands etc.\n\n**Importance of greeting**\n1. Greeting promotes tolerance.\n2. It promotes good neighbourliness.\n3. It promotes courtesy.\n4. It shows appreciation.\n5. It promotes friendliness.\n6. It is a sign of respect to elders.\n\n**Activities**\n- Explain the meaning of greetings.\n- List different ways of greetings.\n- Mention reasons why we need to greet one another.\n\n---\n\n### Ways of keeping our Environment clean\n\nOur environment is our surroundings. We must keep our homes, streets and schools clean at all times.\n1. We must sweep the floor of the rooms everyday.\n2. We must wash the toilet with disinfectant and make it clean.\n3. We must clean the furniture, windows and doors to remove the sta...",
  "rs": "### Jesus' Teaching on How to pray\n\nJesus taught us some ways to pray. some of them are stated below.\n1. **pray without ceasing:** This means we pray to God always.\n2. **pray to God in secret:** We should not pray because we want people to hear what we are praying about.\n3. **Pray without getting discouraged:** If we pray to God and the answer has not come we should keep praying.\n4. **pray in faith without doubt:** We should have belief that God will hear us whenever we pray.\n5. **pray for something specific:** pray for what you want God to do for you.\n\n**Homework**\nWrite the Lord's prayer\n\n---\n\n### Jesus' power over Natural forces\n\nJesus is the son of God. He has power over all things on earth. He has power over natural forces. Jesus demonstrated his power by:\n1. **Calming the sea:** There was a great storm which almost sank the ship. But Jesus spoke to the wind and said 'Peace be still' and the wind stopped immediately.\n2. **Walking on the sea:** Jesus walked on the sea.\n\n---\n\n### Feeding of the five Thousand people\n\nWhen Jesus went to the mountain with his disciples, about five thousand people followed them. When Jesus saw that the people might be hungry, He called one of his disciples and asked him how they could get bread to feed them.\nHe was told that a boy had five loaves of bread and two small fishes. He prayed and gave them to his disciples to give to the people. They all ate and were satisfied. They had 12 full baskets of leftovers.\n\n**People whom Jesus healed**\n1. Peter's Mother-in-law\n2. The paralysed man\n\n**People whom Jesus raised from the dead**\n1. Jairus's Daughter\n2. The widow's son\n3. Raising of Lazarus\n\n---\n\n**Memory Verse (Luke 7:16)**\nA great prophet is risen up among us; and that God has visited his people.\n\n---\n\n### Jesus' power over Diseases and Death\n\nJesus performed a lot of miracles on earth. He helped so many people with his power. He healed the sick and raised the dead.\n\n**People wh...",
  "phe": "### Rest\n\nRest is the period that a person is not doing anything. When the body works for a long period of time it needs rest so as to relax the muscles. Too much work for a long period of time harms the body.\n\n**Importance of resting**\n1. It helps both children and adolescent to grow.\n2. It refreshes the mind and the body organs.\n3. Rest help us to concentrate better at school or work.\n4. Rest helps the brain and the heart to function well.\n\n---\n\n### Week 3\n\n**Sleeping**\n\nSleeping is when a person lies down with his eyes closed while the mind and body are inactive.\n\n**Best conditions for sleeping**\n1. people should sleep in a comfortable room.\n2. people should sleep in a well ventilated room.\n3. The beddings should be clean and comfortable.\n4. Avoid overcrowding of people on the same bed.\n5. Avoid overcrowding of people in the same room.\n\n---\n\n### First Aid\n\nFirst aid is the first assistance given to an injured or sick person before the arrival of a medical doctor. The purpose of first aid is to ease the victim's pains and to prevent his or her condition from getting worse.\n\n---\n\n### Conditions that require First Aid\n\nSome of the conditions which require first aid are:\na. **Severe bleeding:** Bleeding occurs when blood flows out of the blood vessels. Bleeding can be internal or external.\n\n**Steps in stopping bleeding**\n1. Calm the patient and let him lie down flat on the floor or bed.\n2. Make the patient not be to have fear.\n3. Loose the clothes around the victim's neck and waist to allow easy breathing.\n4. Raise the bleeding part of the body to reduce the flow of blood to the affected area.\n5. Raise the foot of the bed to allow more blood to flow to the brain so as to prevent fainting.\n\n---\n\n### Fainting\n\nThis is a temporary loss of consciousness. A person who has fainted may lose touch with things happening within and around him. Fainting may occur as a result of insufficient supply of air or blood to the...",
  "e": "### Week 4 - Grammar\n\n**Determiners**\n\nfew, some, many, much and any are also called determiners.\nRead the story in your Grammar textbook\nWrite the nouns that they describe in the box below.\n\n| Determiners | Nouns |\n|---|---|\n| 1. few | |\n| 2. some | |\n| 3. many | |\n| 4. much | |\n| 5. any | |\n\n---\n\n### Adjectives\n\nAdjective are words that describe or talk about a Noun.\n\n**Examples of Adjective**\n1. greedy\n2. beautiful\n3. ugly\n4. success\n5. power\n6. dirt\n7. rich\n8. poor\n9. slow\n10. pain\n\n**Classwork**\nMake five sentences using Adjectives\n\n---\n\n### Week 6 - Grammar\n\n**Adverbs**\n\nAdverbs are words that tell you more about verbs or words for actions. Many adverbs end in -ly. There are different types of adverbs which are: Adverb of manner which tell you 'how' actions happen. Adverb of time which tell you 'when' actions happen. Adverbs of place which tell you 'where' actions happen.\n- The old lady walked slowly.\n- All the guests arrived late for the party.\n- Port Harcourt is a garden city, everywhere there are trees and flowers.\n\n**Classwork**\nGrammar practice workbook page 54 & 55\n\n**Homework**\npage 56 & 57\n\n---\n\n### Preposition\n\nA preposition is a word that tells you where or when something is in relation to something else. Prepositions are usually has a noun or pronoun after it. Some preposition are used to show time or when something happens.\nExamples of prepositions are: in, from, at, for, of, above, between, over, across, under, inside, next to, at, before, after, on.\n\n---\n\n### WEEK 8 - Grammar\n\n**The Verb (be)**\n\nThe words 'is' and 'are' are forms of the verb be.\nYou use 'is' or 'isn't' with singular nouns.\nYou use 'are' or 'aren't' with plural nouns.\n\n**Classwork**\npage 62\n\n**Homework**\npage 63",
  "m": "### Mathematics\n\n**Time**\n*(Image of a clock face)*\n\nThe clock face shows 12-hour clock times. The long hand on the clock face is called minute hand. It tells the number of minutes past or to the hour. The short hand on the clock face is called the hour hand.\n\n*(Images of clocks showing 4 o'clock and 8 o'clock)*\n- 4 o'clock\n- 8 o'clock\n\n**Classwork**\nWrite the following time\n*(Images of clocks for classwork)*\n\n**Homework**\nWrite the following time\n*(Images of clocks for homework)*\n\n---\n\n### Math\n\n**Analogue and digital time**\n\n*(Image of a clock at 5:00)*\n- Analogue time: 5 o'clock\n- Digital time: 5:00\n\n*(Image of a clock at 5:30)*\n- Analogue time: half past 5\n- Digital time: 5:30 /n/n/n --- Extra instructions for creating quiz: time, Nigerian money, shapes, measurements, data, vertical addition, subtraction and simple multiplication, horizontal calculations (e.g 2 + 3 + 4). Include different kinds of easysums and arithmetic expressions in the objective section/n/n/n --- Extra instructions for creating quiz: time, Nigerian money, shapes, measurements, data, vertical addition, subtraction and simple multiplication, horizontal calculations (e.g 2 + 3 + 4). Include different kinds of easy sums and arithmetic expressions in all sections. Let all the questions be easy sums and calculations. No explanations or facts. This exception is being made for Mathematics, where are all questions are easy sums and calculations"
}