[
  {
    "subject": "History",
    "content": "1. Who was King Jaja of Opobo? a) A famous writer b) A great leader and warrior of Opobo c) A famous singer\n\n2. Where was King Jaja of Opobo from? a) Lagos b) Opobo c) Zaria\n\n3. What was King Jaja of Opobo known for? a) Trading and making Opobo a rich city b) Writing books c) Becoming a teacher\n\n4. What was Oba Ovonranwen known for? a) His role in defending Benin against invaders b) Being a famous athlete c) Writing songs\n\n5. Where did Oba Ovonranwen rule? a) Opobo b) Benin c) Zaria\n\n6. Why was Oba Ovonranwen important to the Benin Kingdom? a) He helped build bridges b) He fought to protect his kingdom during the British invasion c) He taught people how to farm\n\n7. Who was Chief Nana of Itsekiri? a) A famous scientist b) A wealthy and powerful leader of the Itsekiri people c) A popular singer\n\n8. Where did Chief Nana of Itsekiri rule? a) Opobo b) Itsekiri c) Zaria\n\n9. What was Chief Nana of Itsekiri known for? a) His bravery in the fight against British forces b) His art skills c) His ability to sing\n\n10. Who was Queen Aminat of Zaria? a) A famous leader who ruled the Kingdom of Zaria b) A famous teacher c) A well-known musician\n\n11. What is Queen Aminat of Zaria famous for? a) Being a warrior who expanded the Kingdom of Zaria b) Building schools c) Writing books\n\n12. Where did Queen Aminat of Zaria rule? a) Opobo b) Zaria c) Benin\n\n13. What did Queen Aminat of Zaria do during her reign? a) She fought battles to protect her kingdom b) She built bridges c) She traveled around the world\n\n14. Which hero helped in the defense of the Benin Kingdom against the British? a) King Jaja b) Chief Nana c) Oba Ovonranwen\n\n15. What was one of the challenges King Jaja of Opobo faced? a) Fighting invaders b) Being exiled by the British c) Building a new city\n\n16. What did Chief Nana of Itsekiri do after fighting the British? a) He became a teacher b) He moved to another country c) He went into exile\n\n17. Which of these heroes or heroines fought to protect their land from foreign invasion? a) Queen Aminat b) Chief Nana c) All of the above\n\n18. How did Queen Aminat of Zaria help her people? a) By leading successful military campaigns b) By creating art c) By planting trees\n\n19. What did King Jaja of Opobo help his people with? a) Developing the trade business b) Building schools c) Writing history books\n\n20. Which of the following heroes was a leader of the Itsekiri people? a) Chief Nana b) Queen Aminat c) Oba Ovonrowen\n\n21. Where do the Nupe people mostly live? a) In the southeastern part of Nigeria b) In the central part of Nigeria c) In the northern part of Nigeria\n\n22. What language do the Nupe people speak? a) Hausa b) Nupe c) Yoruba\n\n23. The Nupe people are known for which traditional activity? a) Weaving and making pottery b) Farming and fishing c) Writing books\n\n24. What is the capital of the Nupe people’s region? a) Lokoja b) Minna c) Kaduna\n\n25. Which of these is a common food among the Nupe people? a) Pounded yam and soup b) Fufu and egusi c) Tuwo and vegetable soup\n\n26. Where do the Jukun people live? a) In the southern part of Nigeria b) In the northeastern part of Nigeria c) In the central and northeastern parts of Nigeria\n\n27. What language do the Jukun people speak? a) Jukun b) Kanuri c) Igbo\n\n28. Which of these is a traditional Jukun dance? a) Argungu b) Waza c) Jukun traditional dance\n\n29. What is the Jukun people’s main occupation? a) Fishing and farming b) Hunting and gathering c) Trading and weaving\n\n30. Which state is home to many Jukun people? a) Kogi State b) Taraba State c) Ogun State\n\n31. What is the traditional attire of the Gbagyi people? a) Brightly colored robes b) Simple, local fabric wraps c) Animal skins\n\n32. The Gbagyi people are known for living in which region of Nigeria? a) The southwestern region b) The central region c) The southeastern region\n\n33. What language do the Gbagyi people speak? a) Gbagyi b) Yoruba c) Ibo\n\n34. What is the main food of the Gbagyi people? a) Rice and beans b) Yam and cassava c) Noodles and soup\n\n35. What is a traditional Gbagyi festival? a) Durbar Festival b) Ngu Festival c) Argungu Festival\n\n36. The Gbagyi people are also known for what? a) Excellent farming skills b) Pottery making c) Weaving traditional clothes\n\n37. Which of these is a major source of income for the Nupe people? a) Fishing b) Hunting c) Trading and farming\n\n38. What kind of houses do the Jukun people live in? a) Mud huts and houses with thatched roofs b) Tall skyscrapers c) Wooden houses with roofs made of metal\n\n39. Which of the following is a well-known festival of the Gbagyi people? a) Sallah b) Ngu Festival c) Owu Festival\n\n40. What is a traditional item that the Nupe people are known for making? a) Wooden masks b) Pottery and woven baskets c) Metal swords\n\nFILL IN THE BLANKS\n\n1. King Jaja of Opobo was originally born with the name ________.\n2. King Jaja of Opobo was known for his strong leadership in the ________ trade.\n3. King Jaja founded the town of ________ in the Niger Delta region.\n4. Queen Amina was a famous warrior queen from the ancient kingdom of ________.\n5. Queen Amina is famous for building strong ________ to protect her kingdom."
  },
  {
    "subject": "National Values",
    "content": "1. What is a citizen? a) Someone who lives in another country b) Someone who is part of a community or country c) Someone who has a pet\n\n2. How can someone become a citizen of a country? a) By being born in that country or through legal processes b) By visiting the country c) By wearing a country’s flag\n\n3. Which of the following is a responsibility of a good citizen? a) Paying taxes b) Ignoring rules c) Disrespecting others\n\n4. What does it mean to be a responsible citizen? a) Following the rules and helping the community b) Playing all day long c) Avoiding school\n\n5. Why is it important to respect the laws of a country? a) To help the country stay safe and organized b) To make life more difficult c) To avoid getting beating\n\n6. Which of these is a right of a citizen? a) The right to vote b) The right to take other people’s property c) The right to skip school whenever you want\n\n7. What is the right to vote? a) The right to choose leaders in the country b) The right to take a day off work c) The right to travel without any rules\n\n8. Which of these is a right that children have? a) The right to work full-time jobs b) The right to go to school and get an education c) The right to make their own rules at school\n\n9. What is the right to freedom of speech? a) The right to say whatever you want, anytime b) The right to express your thoughts and opinions freely c) The right to shout at others\n\n10. Why do citizens have the right to own property? a) To be able to travel b) To have their own house or land c) To be able to throw away.\n\n11. What is a local government? a) A government in a foreign country b) The people who make decisions for a town or city c) The leaders of a school\n\n12. What is one responsibility of the local government? a) Deciding what people wear b) Making sure there are roads and schools in the community c) Deciding the weather\n\n13. Who is usually in charge of the local government? a) The president b) The mayor or council members c) Teachers\n\n14. What do local governments do to keep the community clean? a) They collect trash and recycle b) They teach people to ignore cleanliness c) They make more trash\n\n15. What is a town meeting? a) A time when people talk about the weather b) A gathering where citizens discuss local issues and make decisions c) A place to eat food together\n\n16. Why is it important to have local governments? a) They help solve problems in the community and make it better b) They play games with people c) They control everyone’s life\n\n17. Who can help make decisions in a local government? a) Only children b) Only people with lots of money c) Citizens who vote and elected leaders\n\n18. What do local governments use taxes for? a) To buy candy for everyone b) To build roads, schools, and parks c) To create new laws that don't help people\n\n19. Which of these might a local government do to help the community? a) Fix broken roads b) Ignore problems in the town c) Tell people not to work\n\n20. How can you participate in your local government? a) By voting when you are old enough and sharing your ideas b) By staying home and doing nothing c) By ignoring rules\n\n21. What is the main purpose of a government? a) To make laws and keep order b) To build roads c) To entertain people\n\n22. What is the government responsible for? a) Making and enforcing laws b) Cooking food for people c) Watching TV\n\n23. Who leads the executive branch of the Nigerian government? a) The President b) The Speaker of the House c) The Chief Justice\n\n24. What is the role of the legislative branch? a) To carry out laws b) To make laws c) To interpret laws\n\n25. Which of these is part of the legislative branch of government? a) The President b) The Senate and the House of Representatives c) The Supreme Court\n\n26. What does the judicial branch do? a) Enforces laws b) Makes laws c) Interprets laws and makes sure they are fair\n\n27. Who interprets the laws in the judicial branch? a) The President b) The Judges c) The Governors\n\n28. Which of these is a duty of the state government? a) Running national elections b) Making laws about local schools c) Printing money\n\n29. Who is in charge of the state government? a) The President b) The Governor c) The Speaker of the House\n\n30. What is one thing that the state government does? a) Builds the White House b) Creates rules for schools and public safety c) Controls the army\n\n31. What do we call the system where power is shared between the state and national governments? a) Democracy b) Federalism c) Monarchy\n\n32. Which branch of government helps make laws? a) Judicial b) Legislative c) Executive\n\n33. Which branch of government enforces the laws? a) Executive b) Legislative c) Judicial\n\n34. Who is part of the state government? a) The President b) The Governor and state legislators c) The Supreme Court\n\n35. What is a responsibility of the local government? a) Making national laws b) Managing police and fire departments c) Running the military\n\n36. What is a major duty of the state government? a) Making laws about schools and public health b) Deciding what movies to watch c) Deciding the price of food\n\n37. Who helps the President enforce laws? a) The Governor b) The President’s helpers c) The police and military\n\n38. Which branch of government does the President belong to? a) Judicial b) Legislative c) Executive\n\n39. What is one duty of the judicial branch? a) To make laws b) To interpret the laws c) To help build roads\n\n40. What is an example of a state government job? a) Deciding national tax rates b) Running state parks c) Deciding foreign policy\n\nFILL IN THE BLANKS\n\n1. A person who is a member of a country and has the right to live there is called a _______.\n2. One of the most important rights of a citizen is the right to _______ in elections.\n3. Citizens have the right to _______ for jobs and work in their country.\n4. A citizen has the responsibility to _______ the laws of their country.\n5. A citizen has the right to _______ an education and attend school."
  },
  {
    "subject": "Math",
    "content": "ANGELWINGS COMPREHENSIVE COLLEGE, MAROKO, PW, KUBWA-ABUJA.\nMATHEMATICS\nGRADE 4\nINSTRUCTION: Answer all questions.\n    1. Change 25/4 to mixed number (fraction).\n    (a) 6 1/4   (b) 4 1/6    (c) 1 4/6   (d) none of the options\n    2. Change 1 7/8 to improper fraction.\n    (a) 14/8    (b) 15/8   (c) 16/8  (d) 17/8\n    3. Round off 48 to the nearest ten.\n    (a) 40     (b) 84      (c) 48      (d) 50\n    4. There are 286 pupils in school A and 192 pupils in school B. What is the total number of pupils in both schools to the nearest hundred?\n    (a) 478     (b) 487      (c) 500      (d) 400\n    5. If one bag of chicken costs ₦489, how much will 8 bags of chicken cost? (to the nearest hundred)\n    (a) 4000     (b) 3900      (c) 3800      (d) 3700\n    6. If one bus can contain 46 pupils, how many pupils will 14 buses contain? (to the nearest  ten)\n    (a) 640 pupils     (b) 600 pupils      (c) 64 pupils      (d) 60 pupils\n    7. What number should be put into the box to make this mathematical statement true? 16 + = 21.\n    (a) 4     (b) 5      (c) 6      (d) 37\n    8. What number should be put into the box, to make this mathematical statement true?             + 47 = 98\n    (a) 51     (b) 15      (c) 145      (d) 154\n    9. What number is represented by the box in this equation?        + 14 = 36\n    (a) 50     (b) 22      (c) 504      (d) none of these options\n    10. What number is represented by the box in this equation?        - 4 = 8\n    (a) 4     (b) 8      (c) 12      (d) 2\n    11. What number is represented by the box in this equation 60         = 12\n    (a) 5     (b) 48      (c) 72      (d) 720\n    12. Round off 19.5 to the nearest whole number.\n    (a) 20     (b) 19      (c) 195      (d) none of these options\n    13. Round off 4.98 to the nearest whole number.\n    (a) 498    (b) 49      (c) 49.8      (d) 5\n    14. Round off 1.29 to the nearest whole number.\n    (a) 129     (b) 12.9      (c) 1.29     (d) 1 \n    15. If mrs Okon buys 20 bars of soap  for ₦4,000. How much does each bar cost?\n    (a) ₦20     (b) ₦200     (c) ₦2,000     (d) ₦80,000 \n    16. Round off 783 to the nearest hundred.\n    (a) 800     (b) 700      (c) 780      (d) 783\n    17. Round off 42 to the nearest ten.\n    (a) 40     (b) 24     (c) 50     (d) 10\n    18. In rounding off, we can ONLY round up to one, TRUE or FALSE? (               )\n    19. In rounding off, we can either round up to one or round down to zero, TRUE or FALSE? (               )\n    20. Open sentences can either be ………. Or ……….\n    21. Convert 2m 40cm to centimetres.\n    (a) 2.4cm     (b) 24.0cm     (c) 240cm     (d) none\n    22. Change 300cm to metres.\n    (a) 0.3m     (b) 3m     (c) 30m     (d) 300000m\n    23. Express 35cm in metres.\n    (a) 0.35m     (b) 0.035m     (c) 3500m     (d) none\n    24. Which of the following are the correct units of length?\n    (a) m, cm     (b) kg, g     (c) t, kt     (d) none\n    25. Convert 2km to metres.\n    (a) 2m     (b) 200m     (c) 2000m     (d) 0.02m\n    26. Change 678m to kilometres.\n    (a) 0.0678km     (b) 0.678km     (c) 678000km     (d) none\n    27. Which of the following correctly represents 9600m in km and m?\n    (a) 0.9km 60m     (b) 9km 600m     (c) 9.6km 6m     (d) none\n    28. ….. is a measure of how heavy something is.\n    (a) Length     (b) Weight     (c) Time     (d) none\n    29. Convert 9kg to grams.\n    (a) 9000g     (b) 900g     (c) 90g     (d) none\n    30. Express 1.5 kg in grams.\n    (a) 150g     (b) 15g     (c) 1500g     (d) 0.015g\n    31. Mr Daniel sold 273.75kg out of 567.5kg of the beans in his shop. What weight is left unsold?\n    (a) 293.7kg     (b) 293.57kg     (c) 293.75kg     (d) none\n    32. Express 970k in Naira.\n    (a) ₦9.70     (b) ₦90.70     (c) ₦900.70     (d) none\n    33. Convert ₦10.08 to Kobo.\n    (a) 108k     (b) 18k     (c) 1008k     (d) none\n    34. Change 17000k to Naira.\n    (a) ₦170     (b) ₦1700     (c) ₦17     (d) none\n    35. Express ₦12.43 in Kobo.\n    (a) 1243k     (b) 124.3k     (c) 12430k     (d) none\n    36. Multiply ₦128.19 by 100.\n    (a) 1281.9k     (b) 12819k     (c) 1281900k     (d) none\n    37. Add ₦138.50 and ₦217.75.\n    (a) ₦356.20       (b) ₦365.25     (c) ₦356.25     (d) none\n    38. Subtract ₦143.74 from ₦336.10\n    (a) ₦192.36     (b) ₦129.36     (c) ₦192.63     (d) none\n    39. Comparing these fractions 1/2 or 3/5, which is smaller? ……..\n    (a) 1/2    (b) 3/5  (c) Both are equal     (d) none\n    40. Comparing these fractions  2/3 or  1/2 , which is bigger?\n    (a) 2/3    (b) 1/2    (c) Both are equal     (d) none\n\nSECTION B\n    41. Round 48 to the nearest 10. ……..\n    42. Round 472 to the nearest whole number. ……..\n    43. Change 29/7 to mixed numbers. ……..\n    44. Change 4 3/5 to improper fraction. ……..\n    45. The square root of 576 is …..\n\n\n\n\n\nSECTION C\nANSWER ALL QUESTIONS\n    (1) a. Michael went to the market and bought meat worth ₦460.50, fish worth ₦140.10 and vegetables worth ₦200.40. How much did he spend altogether?\nb. Write the following in word form: (i) 8/3    (ii) 3/11     (iii) 18/3\n (2) a. Solve the following equations: (i) X + 4 = 10     (ii) Y-10 = 4     (iii) 2p = 8\n           b. (i) 7 ×          = 56     (ii) 60 ÷          = 12     (iii)  of           = 30\n (3) a. If one bag of chicken costs ₦489, how much will 8 bags cost?\n      b. The sport floor of Angelwings Comprehensive College is 36m long and 24m wide.                Calculate its area.\n    c. The height of a tv stand is 63cm and the height of a tv is 65cm. Calculate its total height.\n(4) With the aid of a clock, show each of the following: a. 3:20am     b. 5:10am     c. half past 9     d. quarter to 3     e. quarter past 4     f. 8:50 am\n(5) a. Subtract the following: (i) 2kg 751g from 7kg 874g     (ii) 13kg 76g from 37kg 161g     (iii) 5kg 140g from 9kg 345g\n     b. Add the following together: (i) 6kg 940g and 2kg 705g     (ii)39kg, 4kg 159g and 13kg 516g     (iii) 13kg 107g and 8kg 887g\n"
  },
  {
    "subject": "English Language",
    "content": "Grammar\n1. Which sentence is correct? a) She are going to the store. b) She is going to the store. c) She going to the store.\n2. Which word is a noun? a) Run b) Happy c) Dog\n3. Choose the correct verb: \"He ____ to school every day.\" a) Goes b) Going c) Went\n4. Which of the following sentences is in past tense? a) I am playing with my friend. b) I played with my friend. c) I will play with my friend.\n5. Which of these is a complete sentence? a) Because she was tired. b) She went home because she was tired. c) Went home she was tired.\n\nReading\n6. What is the main idea of a story? a) The characters’ names b) What the story is mostly about c) The places in the story\n7. If you are reading a story about a boy who loves to play soccer, what is the likely theme? a) Cooking b) Sports and teamwork c) Going to the zoo\n8. What does \"plot\" mean in a story? a) The name of the characters b) The sequence of events in the story c) The lesson learned in the story\n9. What is a good strategy for understanding a difficult text? a) Skip all the words you don’t know b) Read the text slowly and look up unfamiliar words c) Close the book when it gets hard\n10. Which of these would be a good title for a story about a dog and its adventures? a) \"The Dog Who Traveled the World\" b) \"The History of Dogs\" c) \"How to Build a House\"\n\nVocabulary\n11. What does the word \"gigantic\" mean? a) Very small b) Very large c) Very soft\n12. Which word is a synonym for \"happy\"? a) Sad b) Excited c) Angry\n13. Which word is an antonym for \"slow\"? a) Fast b) Quiet c) Tall\n14. If you describe something as \"smooth,\" it means it is: a) Rough and bumpy b) Soft and soft to touch c) Even and flat\n15. Which of these words means “to look carefully”? a) Stare b) Glance c) Blink\n\nListening\n\n16. If someone says, “Listen carefully,” what should you do? a) Ignore them b) Pay attention and focus on what they are saying c) Start talking loudly\n17. What should you do when listening to a story? a) Look around the room b) Focus on the speaker and understand the story c) Start writing your own\n18. If you don’t understand what someone says, what should you do? a) Ignore them b) Ask them to repeat or explain c) Walk away\nSpeaking\n19. Which sentence is a question? a) He is going to the park. b) Are you coming to the park? c) They play outside every day.\n20. When speaking clearly, what should you do? a) Talk quickly and mumble\nb) Speak slowly and make sure your words are clear\nc) Whisper.\n\n21. Which one is a verb? a) House\nb) Run\nc) Apple\n\n\n\n22. Choose the correct verb for this sentence: \"She _______ to school every day.\" a) Go\nb) Going\nc) Goes\n\n\n\n23. What is the past tense of \"eat\"? a) Eating\nb) Eats\nc) Ate\n\n\n\n24. Which word is a verb in this sentence: \"The dog barks loudly.\" a) Dog\nb) Loudly\nc) Barks\n\n\n\n25. Fill in the blank: \"I _______ my homework yesterday.\" a) Do\nb) Doing\nc) Did\n\n\n\n26. Choose the verb in the sentence: \"Tommy plays football on weekends.\" a) Tommy\nb) Plays\nc) Weekend\n\n\n27. Which sentence uses a verb correctly? a) She play the piano.\nb) She playing the piano.\nc) She plays the piano.\n\n\n\n28. Which verb completes the sentence? \"We _______ to the park now.\" a) Going\nb) Goes\nc) Are going\n\n\n\n29. Which of these is an action verb? a) Blue\nb) Jump\nc) Apple\n\n\n\n30. Which word is a verb in the sentence: \"He talks to his friend every day.\" a) Talks\nb) He\nc) Friend\n\n\n\n\n\n\n31. (Teacher says: \"The cat jumps over the fence.\") What did the cat do? a) Runs\nb) Jumps\nc) Sits\n\n\n\n32. (Teacher says: \"I will help you with your homework.\") What will the teacher do? a) Teach\nb) Help\nc) Talk\n\n\n\n33. (Teacher says: \"The dog is barking loudly.\") What is the dog doing? a) Sleeping\nb) Barking\nc) Running\n\n\n34. (Teacher says: \"We are eating lunch right now.\") What are they doing? a) Playing\nb) Eating\nc) Singing\n\n\n\n35. (Teacher says: \"She is reading a book.\") What is she doing? a) Running\nb) Reading\nc) Sleeping\n\n\n36. Choose the correct verb: \"They _______ to the movie theater.\" a) Go\nb) Goes\nc) Going\n\n\n\n37. What word completes the sentence? \"I _______ my bicycle to school.\" a) Ride\nb) Rides\nc) Riding\n\n\n\n38. Choose the correct verb form: \"He _______ his homework every day.\" a) Do\nb) Does\nc) Did\n\n\n39. Which sentence is correct? a) They is playing soccer.\nb) They are play soccer.\nc) They are playing soccer\n\n\n40. What is the correct verb for this sentence? \"We _______ to the beach last weekend.\" a) Went\nb) Going\nc) Goes\n\nFILL IN THE BLANKS \n1. I have three _______ (apple/apples) in my basket.\n2. She bought some _______ (rice/rices) for dinner.\n3. There are five _______ (dog/dogs) in the park.\n4. Can I have a little _______ (water/waters) to drink?\n5. We need a few _______ (book/books) for the classroom."
  }
]
